{"features": [{"geometry": {"coordinates": [-119.1025, 36.864444], "type": "Point"}, "properties": {"changed": "4 weeks ago", "created": "<time datetime=\"2024-06-27T16:01:46-04:00\">2024-06-27</time>\n", "field_active": "1", "field_incident_description": "The Basin Wildfire is burning in grass, chapparal and oak timber. It is also burning in steep terrain. ", "field_incident_overview": "<p>On June 24th, 2024 the High Sierra Ranger District of the Sierra National Forest, was in the path of a lightning storm that created 18 fires. An additional fire, and by far the largest, is the Basin Fire which was detected, June 26th, 2024. The fire traveled in a northeast direction toward Black Rock at a rapid rate.</p><p>Air resources from the surrounding 18 fires on the High Sierra Ranger District were reassigned to the Basin Fire. Aircraft was utilized to slow the rate of spread. The cause of the Basin Fire is currently under investigation.&nbsp;<br>Over a hundred firefighters responded to the Basin Fire. Hot Shots, hand crews, dozers, and engines focused on point protection for structures in the Balch Camp area. Resource orders were placed to mobilize more forces, to not only focus on the initial attack of the Basin Fire, but to also continue suppressing the 18 other fires that are on the district.&nbsp;</p><p>The fire is at 2000-4500 feet elevation, northeast of Pine Flat Lake, west of the Spanish Mountain, south of Black Rock Rd (11S012) and north of the South Fork of the Kings River.<br>&nbsp;</p><p><br>&nbsp;</p>", "field_percent_of_perimeter": "100", "field_title_and_unit": "CASNF Basin Fire", "field_unit_code": "CASNF", "id": "317686", "lat_deg": "36", "lat_min": "51", "lat_sec": "52", "long_deg": "119", "long_min": "6", "long_sec": "9", "measurement_type": "Acres", "size": "14023", "title": "Basin Fire", "type": "Wildfire", "urlPath": "/casnf-basin-fire"}, "type": "Feature"}, {"geometry": {"coordinates": [-118.10244, 36.50503], "type": "Point"}, "properties": {"changed": "2 months 2 weeks ago", "created": "<time datetime=\"2024-11-23T13:50:41-05:00\">2024-11-23</time>\n", "field_active": "1", "field_incident_description": "", "field_incident_overview": "<p>The Horseshoe Fire originally started on October 30, 2024 in a remote location in very rugged and inaccessible terrain approximately 5 miles southwest of Lone Pine, California. Firefighters used a combination of direct hand line and natural features such as rock faces and boulders along the fire's edge to gain as much containment as possible. Where the fire was not accessible by foot due to hazards and safety concerns firefighters used helicopters to drop water and keep the fire confined to these natural features. Firefighters also constructed contingency line (a fuel break) around the De La Cour Lavender Ranch on Horseshoe Meadows Road, located within the Carroll Creek drainage.</p><p>The first firefighters that arrived on scene did not see any signs of human activity near the fire and there was no lightning activity in the area. This, paired with the limited accessibility by foot, a fire cause could not be determined.</p><p>On November 7 the fire was mapped at 6.4 acres, and hotshot crews assigned to the incident continued coordinating water drops by helicopter as necessary.&nbsp;</p><p>On November 14 and 15, snow fell over the fire area. The fire was contained and controlled, and placed in patrol status on November 16.&nbsp;</p><p>Although no smoke was showing, fires always have the potential to have small, interior pockets of heat until enough precipitation fully extinguishes it. For the following week, the area continued to show no visible smokes even though two wind events passed during that week's timeframe.</p><p>On the evening of November 22, a member of the public reported seeing flames on Horseshoe Meadows Road at 8:19 p.m. and first responders were dispatched to it.</p><p>Evacuations were issued by Inyo County Sheriff's Office for Zone 223A, which included the De La Cour Lavender Ranch. Later, evacuations expanded to other areas, Zones 193, 195, and 197.</p><p>At approximately 3:00 a.m. on November 23, this fire made a significant run downslope from the strong west winds spotting embers in several directions, crossing over Horseshoe Meadows Road and spreading east. By 6:30 a.m. the fire had grown to approximately 4,537 acres. By this time, the fire had significantly slowed its rate of spread and received precipitation on it.</p><p>Due to the aggressive firefighting efforts and aided by significant precipitation, containment reached 95% by the evening of November 25.&nbsp;</p><p>The Horseshoe Fire continued to have sections of open fire line in areas completely inaccessible by firefighters due to terrain, and was continually checked on a regular basis for infrared heat and smoke, until it was determined to be 100% contained on January 28, 2025.</p><p>In the most severely burned areas and steep drainages, safety hazards will also exist for some time, such as debris flows, flooding and rock fall. Due to the se hazards, the Inyo County Sheriff's Office may need to reissue evacuation orders, warnings, or advisories. It is important for residents and visitors to be familiar with the evacuation zones and the READY INYO website:<strong> </strong><a href=\"https://ready.inyocounty.us\"><strong>https://ready.inyocounty.us</strong></a><strong>&nbsp;</strong></p><p><strong>Evacuations and Road Closures: all lifted as of 8:00 a.m. on Wednesday, November 27.</strong></p><p><strong>The Fire was contained on January 28, 2025.</strong></p><p><a href=\"https://protect.genasys.com/search?z=14&amp;latlon=35.622456%2C-117.670897&amp;fbclid=IwY2xjawGvASBleHRuA2FlbQIxMAABHRRKfTIjU8HUSNiubsveqJ-OCnhF8Cr7crXfodpDIRfZdwCTXVnPEt57zg_aem_NFc_taijJ8ZwOruYL59bVw\">https://protect.genasys.com/</a></p><p><a href=\"https://ready.inyocounty.us/pages/horseshoe-fire\">https://ready.inyocounty.us/pages/horseshoe-fire</a></p><p>&nbsp;</p>", "field_percent_of_perimeter": "100", "field_title_and_unit": "CAINF Horseshoe Fire 2024", "field_unit_code": "CAINF", "id": "322826", "lat_deg": "36", "lat_min": "30", "lat_sec": "18.1074", "long_deg": "118 ", "long_min": "6", "long_sec": "8.784", "measurement_type": "Acres", "size": "4537", "title": "Horseshoe Fire 2024", "type": "Wildfire", "urlPath": "/cainf-horseshoe-fire-2024"}, "type": "Feature"}, {"geometry": {"coordinates": [-101.983889, 44.654167], "type": "Point"}, "properties": {"changed": "2 months 3 weeks ago", "created": "<time datetime=\"2025-03-10T21:53:15-04:00\">2025-03-10</time>\n", "field_active": "1", "field_incident_description": "Grassland wildland fire in a rough river break area along Cherry Creek on the Cheyenne River Indian Reservation.", "field_incident_overview": "<p>On March 10, 2025, at approximately 1015 hours, two fires were reported along BIA Route 13 on Cheyenne River Indian Reservation. &nbsp;These fires merged becoming the Route 13 Fire. &nbsp;A third fire, Northside Fire, was reported at 1049 hours. &nbsp;Overnight the fires merged into one Fire, Route 13 Fire. &nbsp;The fire behavior, conditions, and winds prompted the evacuation of Takini School and Community on March 10, 2025. &nbsp;</p><p><strong>Final&nbsp;</strong></p><p><strong>Incident Command reported 100% containment on March 20, 2025.</strong> &nbsp;The fire suppression was complicated by dry heavy fuels (trees, logs, and shrubs) from moderate drought conditions and fire weather conditions with critical and near severe along with frequent wind shifts. &nbsp;The shifting wind directions kept rekindling heavy fuels. &nbsp;There were periods of high winds reducing visibility and testing the fireline throughout the ten days.</p><p>A Type 3 Helicopter and the South Dakota National Guard (SDNG) Type 1 Blackhawk Helicopters were available to address hot spots and map the fire perimeter. &nbsp;The SDNG Type 1 helicopters dropped 20 buckets of water on the fire on Thursday, March 13, 2025. &nbsp;At 660 gallons a bucket, this was approximately 26,000 gallons of water used to address the slop over. &nbsp;<span>The Type 3 helicopter used was more agile and carries a 140-gallon bucket. &nbsp;It was able to Remember to keep </span>drones grounded during wildland fire event because<strong> I</strong><em><strong>F YOU ARE FLYING THEY CANNOT! &nbsp;&nbsp;</strong></em></p><p><em>The Incident Command would like to thank the Takini and surrounding Communities for their support.</em></p><p>A Burned Area Emergency Response assessment is being done, working with other Agencies and personnel to determine future needs.&nbsp;</p><p>Enning Volunteer Fire Department provided initial response joined by BIA Wildland Fire resources along with Dupree, Faith, Isabel, Timber Lake, and Eagle Butte Volunteer Fire Departments. &nbsp;Additional resources were ordered by High Plains Zone Fire Management Officer at the request of the Incident Commander to assist in the Type 3 Incident Command. &nbsp;</p><p>Numerous other Volunteer Fire Departments assisted Cheyenne River on Monday and Tuesday. &nbsp;The fire had at least 135 personnel documented at one point. <em>Thank you to all.</em></p>", "field_percent_of_perimeter": "100", "field_title_and_unit": "SDCRA 2025Route 13 FireSDCRA", "field_unit_code": "SDCRA", "id": "323105", "lat_deg": "44", "lat_min": "39", "lat_sec": "15", "long_deg": "101", "long_min": "59", "long_sec": "02", "measurement_type": "Acres", "size": "33928", "title": "2025-Route 13 Fire-SDCRA", "type": "Wildfire", "urlPath": "/sdcra-2025route-13-firesdcra"}, "type": "Feature"}, {"geometry": {"coordinates": [-100.626944, 45.633528], "type": "Point"}, "properties": {"changed": "2 months 3 weeks ago", "created": "<time datetime=\"2025-03-15T11:33:44-04:00\">2025-03-15</time>\n", "field_active": "1", "field_incident_description": "", "field_incident_overview": "<p>On March 13, 2025, at 1510hrs Central time, a fire was reported west of Wakpala, South Dakota, on Standing Rock Indian Reservation. &nbsp;Two structures were damaged. &nbsp;There are BIA and Volunteer Fire Departments on the fire.</p><p>There are heavy fuels still smoldering. &nbsp;The Incident Command is concerned about high winds with shifting. &nbsp;There is some moisture in the area, but higher temperatures and winds will evaporate any remaining on the surface.</p><p>&nbsp;</p><p>&nbsp;</p>", "field_percent_of_perimeter": "100", "field_title_and_unit": "NDSRA 2025 Hwy 12 MM 176 NDSRA", "field_unit_code": "NDSRA", "id": "323115", "lat_deg": "45", "lat_min": "38", "lat_sec": "00.7", "long_deg": "100", "long_min": "37", "long_sec": "37", "measurement_type": "Acres", "size": "350", "title": "2025 Hwy 12 MM 176 - NDSRA", "type": "Wildfire", "urlPath": "/ndsra-2025-hwy-12-mm-176-ndsra"}, "type": "Feature"}, {"geometry": {"coordinates": [-83.294167, 34.952778], "type": "Point"}, "properties": {"changed": "3 months ago", "created": "<time datetime=\"2025-03-24T09:18:10-04:00\">2025-03-24</time>\n", "field_active": "1", "field_incident_description": "", "field_incident_overview": "<p>The Big Ridge Fire started on March 22nd, 2025 in the Sarah's Creek area of the Warwoman Wildlife Management Area in Clayton, Georgia.</p><p>This fire is currently 88% contained and has received rain.</p><p>No further updates will be made to this page.</p>", "field_percent_of_perimeter": "88", "field_title_and_unit": "GACHF Big Ridge Fire", "field_unit_code": "GACHF", "id": "323144", "lat_deg": "34", "lat_min": "57", "lat_sec": "10", "long_deg": "83", "long_min": "17", "long_sec": "39", "measurement_type": "Acres", "size": "3434", "title": "Big Ridge Fire", "type": "Wildfire", "urlPath": "/gachf-big-ridge-fire"}, "type": "Feature"}, {"geometry": {"coordinates": [-82.645833, 35.064444], "type": "Point"}, "properties": {"changed": "6 days 9 hours ago", "created": "<time datetime=\"2025-03-30T23:05:00-04:00\">2025-03-30</time>\n", "field_active": "1", "field_incident_description": "Wildfire Complex", "field_incident_overview": "<p>The Table Rock Complex is approximately 20 miles northwest or Greenville, South Carolina. The complex consists of the Table Rock Fire and the Persimmon Ridge Fire. The Table Rock Fire is located in Table Rock State Park and is currently active in South Carolina and North Carolina. The Persimmon Ridge Fire is located in Caesars Head State Park, it is active in South Carolina.</p><p><strong>Table Rock Fire: 13,845 acres, 100% contained&nbsp;</strong></p><p><strong>Persimmon Ridge Fire: 2,128 acres, 100% contained</strong></p><p><strong>Table Rock Complex Total: 15,973 acres, 100% contained</strong></p>", "field_percent_of_perimeter": "100", "field_title_and_unit": "SCSCS 2025 Table Rock Complex", "field_unit_code": "SCSCS", "id": "323174", "lat_deg": "35", "lat_min": "3", "lat_sec": "52", "long_deg": "82", "long_min": "38", "long_sec": "45", "measurement_type": "Acres", "size": "15973", "title": "2025 - Table Rock Complex", "type": "Wildfire", "urlPath": "/scscs-2025-table-rock-complex"}, "type": "Feature"}, {"geometry": {"coordinates": [-100.404722, 45.093889], "type": "Point"}, "properties": {"changed": "2 months 1 week ago", "created": "<time datetime=\"2025-04-12T21:27:40-04:00\">2025-04-12</time>\n", "field_active": "1", "field_incident_description": "Grassland fire with pockets of shrubs and sage.", "field_incident_overview": "<p>On April 11, 2025, at 1350 hours a fast-moving fire was reported along South Dakota Highway 212 on the Cheyenne River Indian Reservation. &nbsp;The fire was stopped at BIA Route 7. &nbsp;It is approximately two miles northwest of Marksville, South Dakota, north of SD Highway 212 in Dewey County.</p><p>The fire was declared out on April 24, 2025, with some wetting rains occurring across the Reservation. &nbsp;The wind shifting and changing directions challenged the firefighters by exposing hot spots along the fire edge throughout the containment of this fire. &nbsp;The incident command had a hot spot on the Route 13 fire, 35 days after ignition, reported to them. &nbsp;This is a reminder that it is very dry, rekindling is possible with the drought conditions and frequent high wind events coming from all directions. &nbsp;<strong>Please recheck old fires lit this winter and ensure field equipment is maintained to prevent sparks.</strong></p><p>On Wednesday, April 16th, the Incident Command utilized aviation resources to reinforce perimeters and prohibit rekindles. &nbsp;The aircraft used was a Single Engine Air Tanker - a small, fixed wing aircraft. &nbsp;This is a reminder that <strong>if you have a drone flying near an active fire, we cannot use aircraft. &nbsp;</strong>BIA Wildland Fire Management has aviation resources available within the Great Plains Region due to the fire conditions forecast for April.</p><p>Gettysburg Volunteer Fire Department provided initial response joined by BIA Wildland Fire Resources along with <span>Dupree, Trail City, Timber Lake and Eagle Butte Volunteer Fire Departments.&nbsp;</span></p>", "field_percent_of_perimeter": "100", "field_title_and_unit": "SDCRA 2025Buffalo Fire", "field_unit_code": "SDCRA", "id": "323222", "lat_deg": "45", "lat_min": "05", "lat_sec": "38", "long_deg": "100", "long_min": "24", "long_sec": "17", "measurement_type": "Acres", "size": "611", "title": "2025-Buffalo Fire", "type": "Wildfire", "urlPath": "/sdcra-2025buffalo-fire"}, "type": "Feature"}, {"geometry": {"coordinates": [-105.023472, 38.994], "type": "Point"}, "properties": {"changed": "2 months 3 weeks ago", "created": "<time datetime=\"2025-04-13T00:41:33-04:00\">2025-04-13</time>\n", "field_active": "1", "field_incident_description": "Type 4 Incident", "field_incident_overview": "<p>The Turkey Track fire is located 8 miles north of Woodland Park, CO. The fire is burning in grass, dead and downed trees and shooting debris.&nbsp;</p>", "field_percent_of_perimeter": "100", "field_title_and_unit": "CO0212 Turkey Track", "field_unit_code": "CO0212", "id": "323223", "lat_deg": "38", "lat_min": "59", "lat_sec": "38.4", "long_deg": "105", "long_min": "01", "long_sec": "24.5", "measurement_type": "Acres", "size": "128", "title": "Turkey Track", "type": "Wildfire", "urlPath": "/co0212-turkey-track"}, "type": "Feature"}, {"geometry": {"coordinates": [-109.930833, 31.945], "type": "Point"}, "properties": {"changed": "1 month 4 weeks ago", "created": "<time datetime=\"2025-04-28T18:37:05-04:00\">2025-04-28</time>\n", "field_active": "1", "field_incident_description": "Wildfire ", "field_incident_overview": "<p>As of May 6, 2025, the Coronado National Forest has terminated their Temporary Occupancy and Use Area Order due to the Stronghold Fire.&nbsp;</p><p>The fire is now 85% contained with no change in acreage; 2,138 acres.&nbsp;</p><p>The Stronghold Fire started at approximately 11:30 am on Monday, April 28, near Sunsites-Pearce and 16 miles south of Cochise. It was fueled by high winds and drought stricken fuels throughout the duration of the initial attack period. Heavy aircraft was used at the start, including Single Engine Air Tankers and Large Air Tankers to slow the fire from spreading to nearby homes. One secondary structure was destroyed in the fire. Stronghold remains under investigation.&nbsp;</p><p>&nbsp;</p><p><strong>For more information: &nbsp;</strong></p><p>Coronado National Forest Temporary Closure Order: <a href=\"https://www.fs.usda.gov/r03/coronado/alerts/stronghold-fire\">https://www.fs.usda.gov/r03/coronado/alerts/stronghold-fire</a></p><p>All evacuation information will come from the Cochise County Sheriff's Office: <a href=\"https://www.facebook.com/CochiseSO\">https://www.facebook.com/CochiseSO</a></p><p>Arizona Department of Forestry and Fire Management on Facebook: <a href=\"https://www.facebook.com/arizonaforestry\">https://www.facebook.com/arizonaforestry</a></p><p>Arizona Department of Forestry and Fire Management on X: <a href=\"https://x.com/azstateforestry\">https://x.com/azstateforestry</a></p>", "field_percent_of_perimeter": "100", "field_title_and_unit": "AZA3S Stronghold Fire", "field_unit_code": "AZA3S", "id": "323275", "lat_deg": "31", "lat_min": "56", "lat_sec": "42", "long_deg": "109", "long_min": "55", "long_sec": "51", "measurement_type": "Acres", "size": "2138", "title": "Stronghold Fire ", "type": "Wildfire", "urlPath": "/aza3s-stronghold-fire"}, "type": "Feature"}, {"geometry": {"coordinates": [-77.114167, 34.8625], "type": "Point"}, "properties": {"changed": "1 month 1 week ago", "created": "<time datetime=\"2025-04-30T19:39:03-04:00\">2025-04-30</time>\n", "field_active": "1", "field_incident_description": "Smoldering, flanking, creeping, isolated torching", "field_incident_overview": "<p>NEW BERN, N.C., May 29, 2025 – The Black Swamp Fire is now 100% contained at 950 acres thanks to the dedicated efforts of the USDA Forest Service and partner agencies, including the North Carolina Forest Service, U.S. Fish and Wildlife, North Carolina Wildlife Resource Commission and the National Park Service.</p><p>A system of dams, pumps, and canals have fully submerged and surrounded the perimeter of the fire, effectively holding it in place. Crews will continue to work on site to implement repairs and rehabilitate roads damaged during suppression efforts.&nbsp;</p><p><span>Due to continued work, closures remain on Black Swamp Road, the Black Swamp OHV area, Great Lake Boating Access Area and Sheep Ridge Wilderness Area, as well as portions of Great Lake Road, Seaborn Road and Holston Hunter Road. To see the full closure order and map, visit&nbsp;</span><a href=\"https://www.fs.usda.gov/r08/northcarolina/alerts/black-swamp-fire-area-closure\"><span>https://www.fs.usda.gov/r08/northcarolina/alerts/black-swamp-fire-area-closure</span></a></p><p><span>For the latest wildfire updates, follow the National Forests in North Carolina on Facebook at U.S. Forest Service - National Forests in North Carolina or visit&nbsp;</span><a href=\"https://l.facebook.com/l.php?u=https%3A%2F%2Fwww.fs.usda.gov%2Fr08%2Fnorthcarolina%3Ffbclid%3DIwZXh0bgNhZW0CMTAAYnJpZBExV25mcDhZS29hamw2cU14cQEedtgBN7tRxDLSMrZAXDlszOH2W1geBKjds0LLDAd_dT76PReSJ8zjhoEa-B8_aem_8jAsj0xZ0irLvIIK6cV9Uw&amp;h=AT3pEwipyQcXI4Zx9LZw2MACd6nWP-9hf9s1NSgnQItI9knvABBE8wKLeNL7eonGNlV4xQ63zH1Mr1fE2RYeS5a-C9TL5xQNSiy08UUvHllYQNS9zYR_vCSeGhM01ol5q7hjVC84Oa-twh2I&amp;__tn__=-UK-R&amp;c%5b0%5d=AT1X5A9fNPq0GoYB1RLW8aRMDCtSo6dpo9H7p_Cmes4yDKQ5H49sJUcFFSfsHuTXzaUq-gdNFOhYBgPmOaXtlNIwN6rEYf_UafHQJRFfb37fx9xLBtfOK-n0FX6RwIgteehL6HH9zC-e2qZdsYC47iM9Ie2RsVA9JNlTjuYzvD9pZjSxmn-juywyQsYHv9zzhf41Hbp9KkVGN-_PPWEek3cwut3p\">https://www.fs.usda.gov/r08/northcarolina</a></p>", "field_percent_of_perimeter": "100", "field_title_and_unit": "NCNCF Black Swamp Fire", "field_unit_code": "NCNCF", "id": "323279", "lat_deg": "34", "lat_min": " 51", "lat_sec": " 45", "long_deg": "77", "long_min": " 6", "long_sec": " 51", "measurement_type": "Acres", "size": "950", "title": "Black Swamp Fire ", "type": "Wildfire", "urlPath": "/ncncf-black-swamp-fire"}, "type": "Feature"}, {"geometry": {"coordinates": [-113.252778, 45.828056], "type": "Point"}, "properties": {"changed": "2 weeks 1 day ago", "created": "<time datetime=\"2025-05-03T13:14:45-04:00\">2025-05-03</time>\n", "field_active": "1", "field_incident_description": "", "field_incident_overview": "<p>The Sawlog Fire was reported on the afternoon of May 1st. Forest Service fire officials from the Beaverhead-Deerlodge National Forest responded to the area, located west of Wise River and northeast of Wisdom in the Sawlog Creek drainage. The fire was initially estimated at 50-70 acres, burning on the south side of the Big Hole River. Immediate access to the fire area was somewhat limited, given the time of year with the snow melt and high water conditions in the river. &nbsp;Upon arriving at the fire's location, firefighters observed the fire burning actively in sagebrush and Lodgepole pine timber. A large \"dead and downed\" component of fuels exists on the north-facing slopes in the area.</p><p>The fire is located between the Sawlog Creek and Toomey Creek drainages, on the south side of the Big Hole River. The fire footprint from the 2021 Christensen Fire is located to the south, and the fire footprint from the 2021 Alder Fire is located to the east.</p><p>Fire investigators are working to determine the exact cause of the fire. Neither the Forest Service nor the BLM had any prescribed fires (commonly referred to as “controlled burns”) in that area.</p>", "field_percent_of_perimeter": "100", "field_title_and_unit": "MTBDF Sawlog", "field_unit_code": "MTBDF", "id": "323294", "lat_deg": "45", "lat_min": "49", "lat_sec": "41", "long_deg": "113", "long_min": "15", "long_sec": "10", "measurement_type": "Acres", "size": "2030", "title": "Sawlog", "type": "Wildfire", "urlPath": "/mtbdf-sawlog"}, "type": "Feature"}, {"geometry": {"coordinates": [-116.44, 45.380639], "type": "Point"}, "properties": {"changed": "5 days 12 hours ago", "created": "<time datetime=\"2025-05-05T16:59:26-04:00\">2025-05-05</time>\n", "field_active": "1", "field_incident_description": "", "field_incident_overview": "<p><span>After ignitions took place during the last week of April on the Windy Shingle prescribed fire unit, burning material rolled out of the prescribed burn unit and into a steep, inaccessible area of Shingle Creek. The Prescribed Fire has now been converted to a Wildfire by definition for administrative and resource ordering purposes. Under this declaration, Fire Management ordered appropriate resources and a Type 3 Incident Commander to fully confine, control, and contain the unplanned ignition outside of the prescribed fire unit. Salmon River Ranger District Fire Management continues to closely monitor the inaccessible areas of this fire using a variety of resources including ground crews, UAS (Drones), and infrared detection systems.&nbsp;</span></p>", "field_percent_of_perimeter": "", "field_title_and_unit": "IDNCF Shingle", "field_unit_code": "IDNCF", "id": "323306", "lat_deg": "45", "lat_min": "22", "lat_sec": "50.3", "long_deg": "116", "long_min": "26", "long_sec": "24", "measurement_type": "Acres", "size": "100", "title": "Shingle", "type": "Wildfire", "urlPath": "/idncf-shingle"}, "type": "Feature"}, {"geometry": {"coordinates": [-109.893194, 32.941889], "type": "Point"}, "properties": {"changed": "1 month 2 weeks ago", "created": "<time datetime=\"2025-05-09T21:57:46-04:00\">2025-05-09</time>\n", "field_active": "1", "field_incident_description": "Wildfire ", "field_incident_overview": "<p>The Bryce Fire is now 100% contained at 3,294 acres. We have turned the incident back to the local district.&nbsp;</p><p>The Bryce Fire started Wednesday, May 7, within the Gila River bottom near the communities of Eden and Pima. The fire was 80% contained on Thursday, but on Friday high winds caused the fire to spot over a nearly 30' containment line on the north side.&nbsp;</p><p>For traffic or road information: <a href=\"https://az511.com\">az511.com</a></p><p>Arizona Department of Forestry and Fire Management on Facebook: <a href=\"https://www.facebook.com/arizonaforestry\">https://www.facebook.com/arizonaforestry</a></p><p>Arizona Department of Forestry and Fire Management on X: <a href=\"https://x.com/azstateforestry\">https://x.com/azstateforestry</a></p><p>&nbsp;</p>", "field_percent_of_perimeter": "100", "field_title_and_unit": "AZA3S Bryce Fire", "field_unit_code": "AZA3S", "id": "323334", "lat_deg": "32", "lat_min": "56", "lat_sec": "30.8", "long_deg": "109", "long_min": "53", "long_sec": "35.5", "measurement_type": "Acres", "size": "3294", "title": "Bryce Fire", "type": "Wildfire", "urlPath": "/aza3s-bryce-fire"}, "type": "Feature"}, {"geometry": {"coordinates": [-91.984444, 47.375833], "type": "Point"}, "properties": {"changed": "6 days 14 hours ago", "created": "<time datetime=\"2025-05-12T22:51:54-04:00\">2025-05-12</time>\n", "field_active": "1", "field_incident_description": "", "field_incident_overview": "<p>The Jenkins Creek Fire ignited on Monday, May 12, 2025, around 11:00 a.m. It was detected east of County Road 110 and north of County Road 16 near Jenkins Creek, approximately 15 miles southeast of Hoyt Lakes, Minnesota. The fire rapidly expanded due to hot temperatures, low relative humidity, and strong south winds, burning through mixed boreal forest and grassy ground cover, including areas heavily infested by spruce budworm, which contributed to the fire's intensity.&nbsp;</p><p>A National Incident Management Organization (NIMO) team took control of the fire on May 28, 2025 from the Eastern Area Complex Incident Management Team who took command of the fire on May 14. In addition to firefighting handcrews, resources deployed included multiple engines, bulldozers, tracked vehicles, and aerial support. Firefighters are focusing on full suppression tactics, structure protection, and establishing containment lines.&nbsp;</p><p>The fire initially exhibited extreme behavior, including crown fires and rapid spread through dense forested areas. The presence of dead and dying trees, particularly those affected by spruce budworm infestations, provided ample fuel for the fire's growth. After a couple days, the spread slowed as crews responded, winds subsided, and moisture moved into the area. Firefighters were able to take advantage of that opportunity and built line that held through another wind event a couple days later. Since then, containment has continued to be effectively established.</p><p>Evacuations have now been lifted. Some recreation site and road closures on Superior National Forest remain in effect.</p><p>Local communities and organizations, like the Red Cross and United Way, are supporting firefighting efforts and assisting displaced residents.&nbsp;</p>", "field_percent_of_perimeter": "100", "field_title_and_unit": "MNSUF Jenkins Creek Fire", "field_unit_code": "MNSUF", "id": "323351", "lat_deg": "47", "lat_min": "22", "lat_sec": "33", "long_deg": "91", "long_min": "58", "long_sec": "64", "measurement_type": "Acres", "size": "16490", "title": "Jenkins Creek Fire", "type": "Wildfire", "urlPath": "/mnsuf-jenkins-creek-fire"}, "type": "Feature"}, {"geometry": {"coordinates": [-109.4535, 34.022333], "type": "Point"}, "properties": {"changed": "1 month 1 week ago", "created": "<time datetime=\"2025-05-13T23:02:13-04:00\">2025-05-13</time>\n", "field_active": "1", "field_incident_description": "Wildfire ", "field_incident_overview": "<p>The Greer Fire started at approximately 11am on May 13, 2025 within Greer proper on the west side of County Road 1120. The wind-driven fire is pushing to the east/northeast along the ridges through grass and pinyon-juniper. The cause of the fire is under investigation.</p><p><a href=\"https://nifc.maps.arcgis.com/apps/instant/sidebar/index.html?appid=23f4e60c2c8b402bb23c89ef37e13950&amp;fbclid=IwY2xjawKUvT9leHRuA2FlbQIxMQBicmlkETFsT1lmbVJNQlZTUktpcjFmAR7u4t0z1XxYbUlsmSjZB3M2JW-Z7rdmw2XvmwHfynZPq26ulljWVdCe5YP6iA_aem_BFx0kZEcPhD_bUa03EniHg\">Interactive Evacuation Map</a></p><p><a href=\"https://az511.com\">ADOT highway/traffic information</a></p><p><a href=\"//wildlandfire.az.gov\">Fire Restrictions</a></p><p><a href=\"https://inciweb.wildfire.gov/incident-publication/aza2s-greer-fire/amended-greer-fire-incident-area-and-road-emergency-closure-05-19-2025\">Forest Service Closure Order</a></p>", "field_percent_of_perimeter": "100", "field_title_and_unit": "AZA2S Greer Fire", "field_unit_code": "AZA2S", "id": "323361", "lat_deg": "34", "lat_min": "01", "lat_sec": "20.4", "long_deg": "109", "long_min": "27", "long_sec": "12.6", "measurement_type": "Acres", "size": "20308", "title": "Greer Fire ", "type": "Wildfire", "urlPath": "/aza2s-greer-fire"}, "type": "Feature"}, {"geometry": {"coordinates": [-118.7107, 35.4805], "type": "Point"}, "properties": {"changed": "1 month 2 weeks ago", "created": "<time datetime=\"2025-05-19T15:11:06-04:00\">2025-05-19</time>\n", "field_active": "1", "field_incident_description": "", "field_incident_overview": "<p>Located in the Kern River Canyon along Hwy 178, a mile up from the Upper Richbar day use area, a vegetation fire started, Sunday, May 18th, 2025, at approximately 3:30 p.m., as an interagency response between the <a href=\"https://www.facebook.com/USForestService?__cft__[0]=AZUTNIA65P0DnOfx2_j40cH8zvNqtP0hSlfuCJwUHhk-tVRfRhM6Aw0hv2a-6WeAfMptAT1R9GxWETJjYE_fOdXccDj6-9VPktPJN-5ND6cWVOljI3Y3pCOq_EGYryFZQiMrOrkoWiGd2E6l_yA_x3618RZzfU8ueeSKFk5NMj9VMQ&amp;__tn__=-]K-R\"><span><strong>U.S. Forest Service</strong></span></a>, <a href=\"https://www.facebook.com/kerncountyfire?__cft__[0]=AZUTNIA65P0DnOfx2_j40cH8zvNqtP0hSlfuCJwUHhk-tVRfRhM6Aw0hv2a-6WeAfMptAT1R9GxWETJjYE_fOdXccDj6-9VPktPJN-5ND6cWVOljI3Y3pCOq_EGYryFZQiMrOrkoWiGd2E6l_yA_x3618RZzfU8ueeSKFk5NMj9VMQ&amp;__tn__=-]K-R\"><span><strong>Kern County Fire Department</strong></span></a> , and <a href=\"https://www.facebook.com/BLMFire?__cft__[0]=AZUTNIA65P0DnOfx2_j40cH8zvNqtP0hSlfuCJwUHhk-tVRfRhM6Aw0hv2a-6WeAfMptAT1R9GxWETJjYE_fOdXccDj6-9VPktPJN-5ND6cWVOljI3Y3pCOq_EGYryFZQiMrOrkoWiGd2E6l_yA_x3618RZzfU8ueeSKFk5NMj9VMQ&amp;__tn__=-]K-R\"><span><strong>Bureau of Land Management Fire</strong></span></a>.&nbsp;</p><p>Joint efforts of heavy equipment, air attack, hand crews, engines, and water tenders responded quickly. The fire is being diligently fought by our resources, who will continue their efforts to improve containment. The cause of the fire remains under investigation. &nbsp;</p>", "field_percent_of_perimeter": "90", "field_title_and_unit": "CASQF Democrat Fire", "field_unit_code": "CASQF", "id": "323408", "lat_deg": "35", "lat_min": "28", "lat_sec": "49.7994", "long_deg": "118", "long_min": "42", "long_sec": "38.52", "measurement_type": "Acres", "size": "895", "title": "Democrat Fire", "type": "Wildfire", "urlPath": "/casqf-democrat-fire"}, "type": "Feature"}, {"geometry": {"coordinates": [-110.766967, 32.594917], "type": "Point"}, "properties": {"changed": "1 month 2 weeks ago", "created": "<time datetime=\"2025-05-20T22:59:34-04:00\">2025-05-20</time>\n", "field_active": "1", "field_incident_description": "", "field_incident_overview": "<p>A wildfire was reported and confirmed at 4:56 pm on May 20, 2025, near the town of Oracle in the Santa Catalina Ranger District. The Santa Catalina Ranger District Type 4 Incident Organization has been deployed for the full suppression initial attack and is currently responding with local resources.&nbsp;</p><p>Visitors are asked to please avoid the area.</p>", "field_percent_of_perimeter": "50", "field_title_and_unit": "AZCNF Cedar Fire", "field_unit_code": "AZCNF", "id": "323418", "lat_deg": "32", "lat_min": "35", "lat_sec": "41.7", "long_deg": "110", "long_min": "46", "long_sec": "1.08", "measurement_type": "Acres", "size": "10", "title": "Cedar Fire", "type": "Wildfire", "urlPath": "/azcnf-cedar-fire"}, "type": "Feature"}, {"geometry": {"coordinates": [-110.73866, 32.5855], "type": "Point"}, "properties": {"changed": "1 month ago", "created": "<time datetime=\"2025-05-21T21:00:30-04:00\">2025-05-21</time>\n", "field_active": "1", "field_incident_description": "", "field_incident_overview": "<p><span>Please direct any questions regarding the Cody Fire to the Coronado National Forest at 520-388-8300.&nbsp;</span></p>", "field_percent_of_perimeter": "95", "field_title_and_unit": "AZCNF Cody Fire", "field_unit_code": "AZCNF", "id": "323421", "lat_deg": "32", "lat_min": "35", "lat_sec": "7.8", "long_deg": "110", "long_min": "44", "long_sec": "19.1754", "measurement_type": "Acres", "size": "1223", "title": "Cody Fire", "type": "Wildfire", "urlPath": "/azcnf-cody-fire"}, "type": "Feature"}, {"geometry": {"coordinates": [-119.15443, 38.00659], "type": "Point"}, "properties": {"changed": "4 weeks ago", "created": "<time datetime=\"2025-05-23T00:15:46-04:00\">2025-05-23</time>\n", "field_active": "1", "field_incident_description": "Vegetation fire on both sides of Highway 395, south of the town of Mono City, and north of the city of Lee Vining, California.", "field_incident_overview": "<p>The Inn Fire started on Thursday May 22, 2025 at approximately 3:36 p.m. on the west side of Highway 395, just south of Mono City. Erratic winds caused the fire to grow quickly and spot across the east side of Highway 395. A full suppression response was ordered by fire management, including firefighting aircraft. Highway 395 was immediately closed in both directions for safety and for the threat and impacts to power lines.&nbsp;</p><p>Evacuation orders were issued for Mono City, then Lundy Canyon after, with evacuation order downgraded to a warning at 9 p.m. on May 24.&nbsp;</p><p>The fire was called 100% contained at 6:00 p.m. on June 4.</p><p><strong>Closure information:</strong>&nbsp;</p><ul><li>An area closure is in place for the fire: <a href=\"https://www.fs.usda.gov/r05/inyo/alerts/inn-fire-closure-order\">https://www.fs.usda.gov/r05/inyo/alerts/inn-fire-closure-order</a></li><li>An area closure is in place for Mono Lake County Park. Please contact Mono County Tourism for more information: <a href=\"https://www.monocounty.org/listing/mono-lake-park/1445/\">https://www.monocounty.org/listing/mono-lake-park/1445/</a> </li><li>Highway 395 is fully open.</li></ul><p>Evacuations: Download the Genasys Protect App to stay informed about evacuations in Mono or Inyo Counties: <a href=\"https://protect.genasys.com/download\"><strong>https://protect.genasys.com/download</strong></a><strong>&nbsp;</strong></p>", "field_percent_of_perimeter": "100", "field_title_and_unit": "CAINF Inn Fire 2025", "field_unit_code": "CAINF", "id": "323426", "lat_deg": "38", "lat_min": "0", "lat_sec": "23.724", "long_deg": "119", "long_min": "9", "long_sec": "15.948", "measurement_type": "Acres", "size": "728", "title": "Inn Fire 2025", "type": "Wildfire", "urlPath": "/cainf-inn-fire-2025"}, "type": "Feature"}, {"geometry": {"coordinates": [-109.808056, 32.641944], "type": "Point"}, "properties": {"changed": "1 month 1 week ago", "created": "<time datetime=\"2025-05-27T11:27:23-04:00\">2025-05-27</time>\n", "field_active": "1", "field_incident_description": "", "field_incident_overview": "<p>The Jacobson Fire broke out in the Turkey Flat area of Mount Graham, Safford Ranger District, on the night of Monday, March 26, 2025, at 9:35 p.m. The Type 3 Incident Management Team has been called in and will be responding with additional resources en route.&nbsp;</p><p>As of Tuesday, May 27, 2025, there are four hotshot crews, one State of Arizona hand crew, and local resources responding. Air attack is en route with two Type 1 helicopters to perform water bucket drops. Very Large Airtankers (VLAT) and Large Airtankers (LAT) are en route and will be performing retardant drops starting this morning.&nbsp;</p><p>For the safety of yourself and the firefighters, please avoid the area as there will be additional fire traffic.&nbsp;</p>", "field_percent_of_perimeter": "44", "field_title_and_unit": "AZCNF Jacobson Fire", "field_unit_code": "AZCNF", "id": "323458", "lat_deg": "32", "lat_min": "38", "lat_sec": "31", "long_deg": "109", "long_min": "48", "long_sec": "29", "measurement_type": "Acres", "size": "8", "title": "Jacobson Fire", "type": "Wildfire", "urlPath": "/azcnf-jacobson-fire"}, "type": "Feature"}, {"geometry": {"coordinates": [-108.478722, 34.146306], "type": "Point"}, "properties": {"changed": "4 weeks ago", "created": "<time datetime=\"2025-05-27T11:34:19-04:00\">2025-05-27</time>\n", "field_active": "1", "field_incident_description": "", "field_incident_overview": "<p>Wildfire north of Quemado Lake, reported May 26 at 7:00 p.m. The Gila Las Cruces Type 3 Incident Command Team assumed command May 27, pursuing a full-suppression strategy to establish containment.</p>", "field_percent_of_perimeter": "92", "field_title_and_unit": "NMGNF Paradise Fire", "field_unit_code": "NMGNF", "id": "323459", "lat_deg": "34", "lat_min": "08", "lat_sec": "46.7", "long_deg": "108", "long_min": "28", "long_sec": "43.4", "measurement_type": "Acres", "size": "727", "title": "Paradise Fire", "type": "Wildfire", "urlPath": "/nmgnf-paradise-fire"}, "type": "Feature"}, {"geometry": {"coordinates": [-110.628889, 31.355833], "type": "Point"}, "properties": {"changed": "3 weeks 4 days ago", "created": "<time datetime=\"2025-06-04T20:18:21-04:00\">2025-06-04</time>\n", "field_active": "1", "field_incident_description": "", "field_incident_overview": "<p>The Ranch Fire is now 100% contained at 2,751 acres.&nbsp;</p><p>The Ranch Fire started approximately 10:00 am, on Wednesday, June 4. The fire was wind-driven as it pushed through heavy fuels of grass, brush, and oak. It progressed through the day to the south/southeast at a moderate rate of spread. Heavy aircraft including a Very Large Air Tanker (VLAT) and two Large Air Tankers (LATs), along with Single Engine Air Tankers (SEATs) worked the fire most of the afternoon in coordination with hand crews and engines. The aircraft use did help decrease fire activity to some degree. &nbsp;</p><p>The fire is located approximately 19 miles southeast of Patagonia and south/southwest of the San Rafael State Natural Area in Santa Cruz County.&nbsp;</p><p>Residents in Santa Cruz can sign up for emergency alerts at: <a href=\"https://entry.inspironlogistics.com/santacruz_az/wens.cfm\">https://entry.inspironlogistics.com/santacruz_az/wens.cfm</a></p><p>READY, SET, GO information: <a href=\"https://ein.az.gov/ready-set-gohttps://ein.az.gov/ready-set-go\">https://ein.az.gov/ready-set-gohttps://ein.az.gov/ready-set-go</a></p><p>Arizona Department of Forestry and Fire Management on Facebook: <a href=\"https://www.facebook.com/arizonaforestry\">https://www.facebook.com/arizonaforestry</a></p><p>Arizona Department of Forestry and Fire on X (formerly Twitter): <a href=\"https://x.com/azstateforestry\">https://x.com/azstateforestry</a></p>", "field_percent_of_perimeter": "100", "field_title_and_unit": "AZA3S Ranch Fire", "field_unit_code": "AZA3S", "id": "323500", "lat_deg": "31", "lat_min": "21", "lat_sec": "21", "long_deg": "110", "long_min": "37", "long_sec": "44", "measurement_type": "Acres", "size": "2751", "title": "Ranch Fire", "type": "Wildfire", "urlPath": "/aza3s-ranch-fire"}, "type": "Feature"}, {"geometry": {"coordinates": [-108.384167, 33.904722], "type": "Point"}, "properties": {"changed": "3 weeks 2 days ago", "created": "<time datetime=\"2025-06-09T20:36:10-04:00\">2025-06-09</time>\n", "field_active": "1", "field_incident_description": "", "field_incident_overview": "<p>6/14/25- An engine crew was on scene the fire today and reported it 100% contained. This will be the last update unless significant changes occur.&nbsp;</p><p>6/10 - The fire received light rain last night and fire crews were able to get line around the fire perimeter. Size of the fire is updated to 1/2 acre due to mapping. One engine a fire module (small crew) will stay on scene today to secure the perimeter and mop up. This will be the final update unless conditions change.</p><p>6/9 - Resources including 4 engines, Gila Interagency Hotshots and a helicopter have responded to a new start east of Aragon, NM. <span>At this time, the Patterson Fire is threatening private residences approximately 1-2 miles west and electric transmission lines 900 yards north. No evacuations are in effect.&nbsp;</span></p>", "field_percent_of_perimeter": "100", "field_title_and_unit": "NMSCD Patterson Fire", "field_unit_code": "NMSCD", "id": "323518", "lat_deg": "33", "lat_min": "54", "lat_sec": "17", "long_deg": "108", "long_min": "23", "long_sec": "03", "measurement_type": "Acres", "size": "1", "title": "Patterson Fire", "type": "Wildfire", "urlPath": "/nmscd-patterson-fire"}, "type": "Feature"}, {"geometry": {"coordinates": [-108.210833, 33.595556], "type": "Point"}, "properties": {"changed": "1 week 6 days ago", "created": "<time datetime=\"2025-06-12T16:10:00-04:00\">2025-06-12</time>\n", "field_active": "1", "field_incident_description": "", "field_incident_overview": "<p>The Buck Fire started on Bureau of Land Management land on 6/11/2025 at approximately 7:30pm from a lightning strike due to thunderstorm activity. It is exhibiting moderate to high fire activity. Multiple resources are on scene and the Albuquerque Zone Type 3 team assumed command of the fire at 6pm on June 14, 2025. <span lang=\"EN-US\">Members of the public should avoid the Buck Fire area.</span><em><span lang=\"EN-US\"> </span></em><span>&nbsp;</span></p><p><span lang=\"EN-US\">Smoke may be visible from Highway 12 southeast of the community of Aragon, NM and southwest of Highway 60. Smoke-sensitive individuals and people with respiratory problems or heart disease are encouraged to take precautionary measures. Information on air quality and protecting your health can be found online at the New Mexico Department of Health (NMDOH) Environmental Public Health Tracking (EPHT) website </span><a href=\"https://gcc02.safelinks.protection.outlook.com/?url=https%3A%2F%2Fnmtracking.org%2Fenvironment%2Fair%2FFireAndSmoke.html&amp;data=05%7C01%7Cjagarcia%40blm.gov%7C4be07fd24e8c4eb54ed508db8eccedd0%7C0693b5ba4b184d7b9341f32f400a5494%7C0%7C0%7C638260783028483616%7CUnknown%7CTWFpbGZsb3d8eyJWIjoiMC4wLjAwMDAiLCJQIjoiV2luMzIiLCJBTiI6Ik1haWwiLCJXVCI6Mn0%3D%7C3000%7C%7C%7C&amp;sdata=iDVIEX37Rxzi8B%2FyP4Nhr6hupxD0Z71Woov08rdyfR4%3D&amp;reserved=0\"><span lang=\"EN-US\">nmtracking.org</span></a><em><span lang=\"EN-US\"> </span></em><span>&nbsp;</span></p>", "field_percent_of_perimeter": "91", "field_title_and_unit": "NMADO Buck Fire", "field_unit_code": "NMADO", "id": "323536", "lat_deg": "33", "lat_min": "35", "lat_sec": "44", "long_deg": "108", "long_min": "12", "long_sec": "39", "measurement_type": "Acres", "size": "57753", "title": "Buck Fire", "type": "Wildfire", "urlPath": "/nmado-buck-fire"}, "type": "Feature"}, {"geometry": {"coordinates": [-115.0063, 46.465233], "type": "Point"}, "properties": {"changed": "1 week 6 days ago", "created": "<time datetime=\"2025-06-12T16:32:20-04:00\">2025-06-12</time>\n", "field_active": "1", "field_incident_description": "", "field_incident_overview": "<p><span>The Post Fire started on Tuesday, June 10 and weather and fuel conditions caused more rapid spread than is typical for this time of year. The fire is burning in rugged terrain with long evacuation times should an accident occur. This is a consideration when determining firefighting strategies and tactics.</span></p><p><span>The greatest potential impacts are to the Highway 12 corridor that runs between Lolo, Montana and Kooskia, Idaho. It also has the potential to impact various forest infrastructure, recreation sites, and natural and cultural resources.&nbsp;</span></p><p><span>Management of the fire transitioned from the Northern Rockies Complex Incident Management Team 5 (IC Joe Sampson) to a local Type 4 organization on Tuesday, June 24 at 6:00 p.m.</span></p><p><span>The fire is being managed under a full suppression strategy, implementing strategies of confinement, containment, and point protection. Currently there are no fire restrictions or road, trail, and area closures.&nbsp;</span></p>", "field_percent_of_perimeter": "94", "field_title_and_unit": "IDNCF Post Fire", "field_unit_code": "IDNCF", "id": "323537", "lat_deg": "46", "lat_min": "27", "lat_sec": "54.8388", "long_deg": "115", "long_min": "0", "long_sec": "22.68", "measurement_type": "Acres", "size": "144", "title": "Post Fire", "type": "Wildfire", "urlPath": "/idncf-post-fire"}, "type": "Feature"}, {"geometry": {"coordinates": [-108.232778, 32.979444], "type": "Point"}, "properties": {"changed": "9 hours 2 minutes ago", "created": "<time datetime=\"2025-06-13T10:32:45-04:00\">2025-06-13</time>\n", "field_active": "1", "field_incident_description": "", "field_incident_overview": "<p><span>On Monday, June 30, 2025, the Gila Las Cruces Type 3 Incident Management Team officially assumed command of the Trout Fire, taking over from the Southwest Area Complex Incident Management Team 4.&nbsp;</span></p><p><span>The Gila National Forest has implemented a closure order. Find the details of the closure in the \"Closures\" tab of this page.</span></p><p>Background: The fire was reported Thursday, June 12, in the Trout Creek area of the Gila National Forest. Driven by hot, dry weather, the fire quickly grew and crossed NM-15 in the afternoon. Command of the fire transferred command to the Gila/Las Cruces Type 3 team Thursday evening. Saturday morning, command will again transfer to a complex incident management team, Southwest Team 4.&nbsp;</p>", "field_percent_of_perimeter": "89", "field_title_and_unit": "NMGNF Trout Fire", "field_unit_code": "NMGNF", "id": "323540", "lat_deg": "32", "lat_min": "58", "lat_sec": "46", "long_deg": "108", "long_min": "13", "long_sec": "58", "measurement_type": "Acres", "size": "47294", "title": "Trout Fire", "type": "Wildfire", "urlPath": "/nmgnf-trout-fire"}, "type": "Feature"}, {"geometry": {"coordinates": [-121.289167, 45.679167], "type": "Point"}, "properties": {"changed": "1 week 6 days ago", "created": "<time datetime=\"2025-06-13T11:18:03-04:00\">2025-06-13</time>\n", "field_active": "1", "field_incident_description": "", "field_incident_overview": "<p>The Rowena Fire started on June 11th, 2025 at approximately 1:30 PM three miles northwest of The Dalles, OR. Local resources responded to the incident and a request for additional support was made.&nbsp;</p><p>Effective Thursday, June 12, 2025 at 5:00 pm, Unified Command was established between ODF Team 2 and OSFM Green Team. For questions, please contact Rowena Public Information at (503) 345-3340.</p>", "field_percent_of_perimeter": "99", "field_title_and_unit": "OR95S Rowena Fire", "field_unit_code": "OR95S", "id": "323541", "lat_deg": "45", "lat_min": "40", "lat_sec": "45", "long_deg": "121", "long_min": "17", "long_sec": "21", "measurement_type": "Acres", "size": "3700", "title": "Rowena Fire", "type": "Wildfire", "urlPath": "/or95s-rowena-fire"}, "type": "Feature"}, {"geometry": {"coordinates": [-110.528889, 42.900278], "type": "Point"}, "properties": {"changed": "1 day 13 hours ago", "created": "<time datetime=\"2025-06-13T17:29:45-04:00\">2025-06-13</time>\n", "field_active": "1", "field_incident_description": "The fire is burning in heavy downed timber and slash.", "field_incident_overview": "<p>The Horse Fire was reported the morning of Friday, June 13, 2025 by a Bridger-Teton National Forest employee. The smoke was visible from McDougal Gap in Sublette County, WY. The lightning-caused fire initially showed some single tree torching and creeping. It is near the confluence of South Horse Creek and Cow Creek approximately 10 miles west of Merna, WY.</p><p>To check air quality in the area, visit <a href=\"https://fire.airnow.gov\">https://fire.airnow.gov</a>&nbsp;</p>", "field_percent_of_perimeter": "70", "field_title_and_unit": "WYBTF Horse Fire", "field_unit_code": "WYBTF", "id": "323548", "lat_deg": "42", "lat_min": "54", "lat_sec": "1", "long_deg": "110", "long_min": "31", "long_sec": "44", "measurement_type": "Acres", "size": "2797", "title": "Horse Fire", "type": "Wildfire", "urlPath": "/wybtf-horse-fire"}, "type": "Feature"}, {"geometry": {"coordinates": [-112.381944, 37.548333], "type": "Point"}, "properties": {"changed": "11 hours 29 minutes ago", "created": "<time datetime=\"2025-06-13T22:02:15-04:00\">2025-06-13</time>\n", "field_active": "1", "field_incident_description": "The France Canyon Fire is burning in rough, inaccessible terrain characterized by a variety of fuels.", "field_incident_overview": "<p>The France Canyon Fire started June 11th at approximately 3 p.m. MST on the Powell Ranger District on the Dixie National Forest. It is burning in rough terrain about 6.5 miles southeast of Hatch, Utah.&nbsp;</p><p><span>Color Country Incident Management Team 1</span>, a Type 3 Incident Management Team, managed the incident between June 11 and June 22.</p><p><span>The Great Basin Team 5 assumed command of the fire on June 22.&nbsp;</span></p><p><span>The Color Country Incident Management Team Type 3, assumed command of the fire on July 4.</span></p><p>Management objectives include&nbsp;</p><ul><li><span lang=\"EN-US\">Provide for incident responder and public safety.</span></li><li><span lang=\"EN-US\">Coordinate with cooperators and local stakeholders.</span></li><li><span lang=\"EN-US\"></span><span lang=\"EN-US\">Reduce the threat to private property, structures and Bryce Canyon National Park.</span></li><li><span lang=\"EN-US\"></span><span lang=\"EN-US\">Protect critical infrastructure (power corridor, travel corridors and Wilson Repeater).</span></li><li><span lang=\"EN-US\">Protect sensitive species habitat identified by the Resource Advisor.</span></li><li><span>Work with Resource Advisors to identify and prioritize fire suppression repair and implement plan&nbsp;</span></li></ul><p>Closures are in effect for the area.</p>", "field_percent_of_perimeter": "84", "field_title_and_unit": "UTDIF France Canyon", "field_unit_code": "UTDIF", "id": "323552", "lat_deg": "37", "lat_min": "32", "lat_sec": "54", "long_deg": "112", "long_min": "22", "long_sec": "55", "measurement_type": "Acres", "size": "34943", "title": "France Canyon", "type": "Wildfire", "urlPath": "/utdif-france-canyon"}, "type": "Feature"}, {"geometry": {"coordinates": [-120.723056, 48.091389], "type": "Point"}, "properties": {"changed": "3 hours 42 minutes ago", "created": "<time datetime=\"2025-06-15T14:47:49-04:00\">2025-06-15</time>\n", "field_active": "1", "field_incident_description": "", "field_incident_overview": "<p><span>The Pomas Fire was started by lightning in the Glacier Peak Wilderness and was first reported on the morning of June 13, 2025. Smokejumpers responded within an hour of the report and were joined by additional smokejumpers, rappelers, and hotshots. Over the next several days firefighters conducted extensive air attack, dropping nearly 400,000 gallons of water on the fire. Because of extremely heavy fuel loads of dead and downed timber from the 2015 Wolverine Fire, aerial attack was ineffective in stopping the fire.&nbsp;</span></p><p><span>Inaccessible by road, the fire is burning in very steep and rugged terrain. There are very limited opportunities for firefighters to work directly, safely, and effectively at the fire’s edge. Hotshot crews supported by water drops from heavy helicopters are directly attacking the fire’s southern flank to halt or slow the fire’s southward progress. The rest of the fire is surrounded by steep rocky slopes and the remains of winter’s snowfall.</span></p><p><span>In addition to this direct attack, firefighters are preparing back-up fire lines at the next possible location, should the primary containment lines be breached. This work involves clearing and widening existing roads, trails, and firebreaks from earlier fires.</span></p><p><span>A third suppression activity is the assessment and protection of structures and infrastructure in the possible path of the fire. Firefighters are preparing sprinklers and defensible space around these values.</span></p><p><span>The cumulative effects of the progressing hot, dry weather are resulting in more active expansion of the fire within the Wilderness and continued pressure on the direct line construction on the southern flank.</span></p>", "field_percent_of_perimeter": "", "field_title_and_unit": "WAOWF Pomas Fire 2025", "field_unit_code": "WAOWF", "id": "323564", "lat_deg": "48", "lat_min": "5", "lat_sec": "29", "long_deg": "120", "long_min": "43", "long_sec": "23", "measurement_type": "Acres", "size": "2379", "title": "Pomas Fire 2025", "type": "Wildfire", "urlPath": "/waowf-pomas-fire-2025"}, "type": "Feature"}, {"geometry": {"coordinates": [-112.312614, 46.485563], "type": "Point"}, "properties": {"changed": "14 hours 4 minutes ago", "created": "<time datetime=\"2025-06-15T15:15:08-04:00\">2025-06-15</time>\n", "field_active": "1", "field_incident_description": "", "field_incident_overview": "<p>On June 15, 2025, the Jericho Mountain Fire was reported burning in heavy dead and down fuel approximately 5 miles south of MacDonald Pass. The Forest Service, Montana DNRC, Baxendale and Elliston Volunteer Fire Departments assisted with initial response.</p><p>Northern Rockies Complex Incident Management Team 6, Incident Commander Rich Cowger took command of the Jericho Mountain Fire at 6 am on June 21, 2025.</p><p>The fire will be transitioning to a Type 3 management team on Wednesday, July 2. Morning updates, maps and photos will only be put on Inciweb if the incident conditions change significantly. Basic information, such as containment, weather and planned operations, will be updated as changes occur.&nbsp;</p><p>Additionally, the <a href=\"https://www.fs.usda.gov/r01/helena-lewisclark/alerts/jericho-mountain-fire-helena-ranger-district\"><span>Helena Ranger District, Helena-Lewis and Clark National Forest </span></a><span>issued a forest closure order. Reroute information for Continental Divide National Scenic Trail hikers can be found on the </span><a href=\"https://www.fs.usda.gov/sites/nfs/files/r01/helena-lewisclark/publication/alerts/CDT%20reroute%202025_FINAL.pdf\"><span>Forest's Webpage</span></a><span>.&nbsp;</span></p><p>Forest officials are asking the public to be cautious when recreating on the Forest, know before you go, check current weather conditions and fire situations before planning an outing. Also, please remember that it’s your job and responsibility to properly maintain and extinguish all campfires. Fireworks are illegal on lands managed by the Forest Service.</p><p>&nbsp;</p>", "field_percent_of_perimeter": "100", "field_title_and_unit": "MTHLF Jericho Mountain Fire", "field_unit_code": "MTHLF", "id": "323565", "lat_deg": "46", "lat_min": "29", "lat_sec": "8.0268", "long_deg": "112", "long_min": "18", "long_sec": "45.4104", "measurement_type": "Acres", "size": "482", "title": "Jericho Mountain Fire", "type": "Wildfire", "urlPath": "/mthlf-jericho-mountain-fire"}, "type": "Feature"}, {"geometry": {"coordinates": [-119.644167, 38.852389], "type": "Point"}, "properties": {"changed": "1 week ago", "created": "<time datetime=\"2025-06-20T16:53:42-04:00\">2025-06-20</time>\n", "field_active": "1", "field_incident_description": "", "field_incident_overview": "<p><span>The Conner Fire is located in the Pinenut Range, 8 Miles Southeast of Gardnerville, NV.</span></p><p><em>Estimated </em><span>acreage is provided below and is subject to change.</span></p>", "field_percent_of_perimeter": "100", "field_title_and_unit": "NVCCD Conner Fire", "field_unit_code": "NVCCD", "id": "323635", "lat_deg": "38", "lat_min": "51", "lat_sec": "08.6", "long_deg": "119", "long_min": "38", "long_sec": "39.0", "measurement_type": "Acres", "size": "17714", "title": "Conner Fire", "type": "Wildfire", "urlPath": "/nvccd-conner-fire"}, "type": "Feature"}, {"geometry": {"coordinates": [-113.515556, 37.346667], "type": "Point"}, "properties": {"changed": "5 hours 39 minutes ago", "created": "<time datetime=\"2025-06-21T13:01:48-04:00\">2025-06-21</time>\n", "field_active": "1", "field_incident_description": "", "field_incident_overview": "<p>The Forsyth fire started on June 19th, approximately 15 miles north of St. George, Utah. The lightning caused fire was initially driven by strong winds and hot, dry conditions.&nbsp;</p><p>The communities of Pine Valley, Grass Valley and Pinto are under a \"Ready\" evacuation status.</p><p>There is a closure order in place on the Pine Valley Ranger District. For information, visit: Alerts and Fire Danger Status on the <a href=\"https://www.fs.usda.gov/r04/dixie\">Dixie National Forest Website</a></p><p>&nbsp;</p>", "field_percent_of_perimeter": "51", "field_title_and_unit": "UTDIF Forsyth", "field_unit_code": "UTDIF", "id": "323642", "lat_deg": "37", "lat_min": "20", "lat_sec": "48", "long_deg": "113", "long_min": "30", "long_sec": "56", "measurement_type": "Acres", "size": "13941", "title": "Forsyth", "type": "Wildfire", "urlPath": "/utdif-forsyth"}, "type": "Feature"}, {"geometry": {"coordinates": [-147.751444, 65.121306], "type": "Point"}, "properties": {"changed": "3 hours 14 minutes ago", "created": "<time datetime=\"2025-06-24T17:40:49-04:00\">2025-06-24</time>\n", "field_active": "1", "field_incident_description": "", "field_incident_overview": "<p><span>The Southwest Area Incident Management Team 3 has assumed command of the Himalaya Road Fire (#223), Aggie Creek Fire (#268) and the Washington Creek Fire (#232). The fires were started from lightning on June 19, 2025 and are burning in the Fairbanks North Star Borough.&nbsp;</span></p>", "field_percent_of_perimeter": "0", "field_title_and_unit": "AKFAS Himalaya Road Fire", "field_unit_code": "AKFAS", "id": "323674", "lat_deg": "65", "lat_min": "7", "lat_sec": "16.7", "long_deg": "147 ", "long_min": "45", "long_sec": "5.2", "measurement_type": "Acres", "size": "6095", "title": "Himalaya Road Fire", "type": "Wildfire", "urlPath": "/akfas-himalaya-road-fire"}, "type": "Feature"}, {"geometry": {"coordinates": [-148.154167, 65.122778], "type": "Point"}, "properties": {"changed": "3 hours 19 minutes ago", "created": "<time datetime=\"2025-06-24T17:59:32-04:00\">2025-06-24</time>\n", "field_active": "1", "field_incident_description": "", "field_incident_overview": "<p><span>The Aggie Creek Fire was started by lightning on June 20, 2025. The Southwest Area Incident Management Team 3 has assumed command of the Himalaya Road Fire (#223), Aggie Creek Fire (#268) and the Washington Creek Fire (#232).&nbsp;&nbsp;</span></p>", "field_percent_of_perimeter": "0", "field_title_and_unit": "AKFAS Aggie Creek Fire", "field_unit_code": "AKFAS", "id": "323675", "lat_deg": "65", "lat_min": "7", "lat_sec": "22", "long_deg": "148", "long_min": "9", "long_sec": "15", "measurement_type": "Acres", "size": "38702", "title": "Aggie Creek Fire", "type": "Wildfire", "urlPath": "/akfas-aggie-creek-fire"}, "type": "Feature"}, {"geometry": {"coordinates": [-148.602778, 64.724722], "type": "Point"}, "properties": {"changed": "20 seconds ago", "created": "<time datetime=\"2025-06-25T22:58:23-04:00\">2025-06-25</time>\n", "field_active": "1", "field_incident_description": "Nenana Ridge Complex: Includes Bonanza Creek Fire (#238) and Goldstream Creek Fire (#270). Located southwest of Fairbanks. The complex is about 28,944 acres. Evacuations are in effect. Traffic is moving on the Parks Highway with pilot cars; expect delays. The Alaska Complex Incident Management Team 2 (AKCIMT) received an in brief from the Type 3 Incident Management Team from Georgia on Saturday. The AKCIMT shadowed on Sunday and assumed command on Monday. ", "field_incident_overview": "<p><strong>Nenana Ridge Complex:</strong> Includes Bonanza Creek Fire (#238) and Goldstream Creek Fire (#270). Located southwest of Fairbanks. The complex is about 28,944 acres. Evacuations are in effect. Traffic is moving on the Parks Highway with pilot cars; expect delays. The Alaska Complex Incident Management Team 2 (AKCIMT) received an in brief from the Type 3 Incident Management Team from Georgia on Saturday. The AKCIMT &nbsp;shadowed on Sunday and assumed command on Monday.</p>", "field_percent_of_perimeter": "", "field_title_and_unit": "AKFAS Nenana Ridge Complex", "field_unit_code": "AKFAS", "id": "323690", "lat_deg": "64", "lat_min": "43", "lat_sec": "29", "long_deg": "148", "long_min": "36", "long_sec": "10", "measurement_type": "Acres", "size": "28944", "title": "Nenana Ridge Complex", "type": "Wildfire", "urlPath": "/akfas-nenana-ridge-complex"}, "type": "Feature"}, {"geometry": {"coordinates": [-149.242778, 64.0425], "type": "Point"}, "properties": {"changed": "6 hours 10 minutes ago", "created": "<time datetime=\"2025-06-26T20:07:13-04:00\">2025-06-26</time>\n", "field_active": "1", "field_incident_description": "", "field_incident_overview": "<p>Thunderstorms on June 19, 2025 created lightning strikes that sparked fires across Alaska. Three fires in this group stated that day: Bear Creek Fire, Saint George Creek Fire, and Bonnifield Creek Fire. Red Flag weather conditions resulted in extreme fire behavior on June 21 and 22.&nbsp;</p><p>The fire endangered communities along the Parks Highway (AK3). Denali Borough issued evacuation orders on June 22. The fire crossed the highway and closed the highway for several hours. Evacuations remain in effect, and traffic restrictions remain while crews work on the side of the road. Saint George Creek Fire and Bonnifield Creek Fire merged on June 23 (now referred to as the Saint George Creek Fire).</p><p>The Alaska Complex Incident Management Team took command of the fire on June 24.&nbsp;</p><p>Evacuation levels were updated on July 2, decreasing levels around the Bear Creek Fire and retaining the Level 3 GO for the entire Saint George Creek Fire. On July 3, evacuation levels were updated again on the Saint George Creek Fire to increase from Level 2 SET on the western flank to Level 1 GO. The fire remains active and growing.</p><p>As of July 6, 2025, the Bear Creek Fire is 30,069 acres and the Saint George Creek Fire (combined with the Bonnifield Creek Fire) is 41,439 acres. There are 312 personnel on site.</p><p>&nbsp;</p>", "field_percent_of_perimeter": "17", "field_title_and_unit": "AKFAS 2025 Bear Creek Fire Group", "field_unit_code": "AKFAS", "id": "323700", "lat_deg": "64", "lat_min": "2", "lat_sec": "33", "long_deg": "149", "long_min": "14", "long_sec": "34", "measurement_type": "Acres", "size": "70138", "title": "2025 - Bear Creek Fire Group ", "type": "Wildfire", "urlPath": "/akfas-2025-bear-creek-fire-group"}, "type": "Feature"}, {"geometry": {"coordinates": [-108.598633, 40.26395], "type": "Point"}, "properties": {"changed": "6 days 15 hours ago", "created": "<time datetime=\"2025-06-27T11:18:26-04:00\">2025-06-27</time>\n", "field_active": "1", "field_incident_description": "As of June 30, 2025- the Horse Draw fire is 100% contained.", "field_incident_overview": "<p><span>June 30, 2025- the Horse Draw fire is 100% contained.</span></p><p><span>Horse Draw fire was reported June 26th at approximately 1:50PM and is burning north of U.S. Highway 40 near mile post 20 in the Horse Draw and Three Springs areas. &nbsp;&nbsp;</span></p>", "field_percent_of_perimeter": "100", "field_title_and_unit": "COWRD Horse Draw Fire", "field_unit_code": "COWRD", "id": "323706", "lat_deg": "40", "lat_min": "15", "lat_sec": "50.22", "long_deg": "108", "long_min": "35", "long_sec": "55.078", "measurement_type": "Acres", "size": "748", "title": "Horse Draw Fire", "type": "Wildfire", "urlPath": "/cowrd-horse-draw-fire"}, "type": "Feature"}, {"geometry": {"coordinates": [-117.351722, 34.291361], "type": "Point"}, "properties": {"changed": "12 hours 3 minutes ago", "created": "<time datetime=\"2025-06-28T21:43:08-04:00\">2025-06-28</time>\n", "field_active": "1", "field_incident_description": "", "field_incident_overview": "<p>The Lake Fire has burned approximately 489.9 acres with 100% containment at this time. The incident is in Unified Command with the USFS: San Bernardino National Forest, CAL FIRE San Bernardino Unit and the San Bernardino County Fire.</p><p><span dir=\"ltr\">Crews will continue to monitor and mop up where needed. &nbsp;Suppression repair of dozer and handlines has been completed, which reduces the effects of erosion, illegal OHV access, and allow the area to revegetate over time.</span></p><p><span dir=\"ltr\">Cal Trans will keep HWY 138 closed for an undetermined period to complete repairs of damage from the fire before reopening, (per Cal Trans). &nbsp;</span><a href=\"https://roads.dot.ca.gov/?roadnumber=138\"><span dir=\"ltr\">Cal Trans Highway Conditions Website.</span></a></p><p>All Evacuation Warnings have been lifted at this time.</p><p><a href=\"https://www.fs.usda.gov/r05/sanbernardino/alerts/fire-and-recreational-shooting-restrictions\">A Forest Order for Elevated Fire Restrictions</a> is in effect as of July 1, 2025. &nbsp;This restricts target shooting to specific designated locations, as well as restricting wood and charcoal fires across most campsites and day-use areas across the San Bernardino National Forest. &nbsp;Propane fueled grills, stoves, etc will continue to be allowed.</p><p><span>Don't let your fun turn into flames. As you make plans to celebrate the 4th of July, please remember that fireworks are prohibited on public lands. - Possessing, igniting, discharging, or using any kind of fireworks is prohibited on national forests and grasslands. &nbsp;Title 36 CFR 261.5(e).</span></p><p>&nbsp;</p>", "field_percent_of_perimeter": "100", "field_title_and_unit": "CABDF 2025 BDU Lake Fire", "field_unit_code": "CABDF", "id": "323721", "lat_deg": "34", "lat_min": "17", "lat_sec": "28.9 ", "long_deg": "117", "long_min": "21", "long_sec": "06.2", "measurement_type": "Acres", "size": "489", "title": "2025 BDU - Lake Fire", "type": "Wildfire", "urlPath": "/cabdf-2025-bdu-lake-fire"}, "type": "Feature"}, {"geometry": {"coordinates": [-106.794327, 41.853392], "type": "Point"}, "properties": {"changed": "4 days 16 hours ago", "created": "<time datetime=\"2025-06-30T18:03:42-04:00\">2025-06-30</time>\n", "field_active": "1", "field_incident_description": "The Taylor Draw fire was burning on land managed by the Bureau of Land Management, Rawlins Field Office and private and State lands protected by Carbon County, Wyoming. The fire was located about 10 miles west of Hanna, Wyoming.", "field_incident_overview": "<p>The Taylor Draw fire reached 100% containment on July 3, 2025. The incident is currently being monitored by local fire units and several resources assigned to the fire have demobilized.</p><p>Final update on this fire occurred on July 3, 2025.</p>", "field_percent_of_perimeter": "100", "field_title_and_unit": "WYHDD Taylor Draw Fire", "field_unit_code": "WYHDD", "id": "323746", "lat_deg": "41", "lat_min": "51", "lat_sec": "12.210", "long_deg": "106", "long_min": "47", "long_sec": "39.576", "measurement_type": "Acres", "size": "1247", "title": "Taylor Draw Fire", "type": "Wildfire", "urlPath": "/wyhdd-taylor-draw-fire"}, "type": "Feature"}, {"geometry": {"coordinates": [-106.754722, 36.338056], "type": "Point"}, "properties": {"changed": "24 minutes 52 seconds ago", "created": "<time datetime=\"2025-06-30T19:11:33-04:00\">2025-06-30</time>\n", "field_active": "1", "field_incident_description": "The lightning caused wildfire is located in the Coyote Ranger District. It is burning in oak brush, Pinyon-juniper, and ponderosa pine. Aerial and ground resources are assigned to the fire. Low intensity surface fire has been observed with moderate rates of spread. Currently the Laguna Wildfire poses no threat to people or property. ", "field_incident_overview": "<p><strong>A closure order for the fire area is in effect July 2,2025. Details provided in incident publications.</strong></p><p>Santa Fe National Forest (SFNF) fire managers actively managing the lightning caused Laguna Fire located in the Coyote Ranger District, 8 miles north of New Mexico State Road 96 and west of the Chama River Canyon Wilderness. Currently, 120 personnel are on the Laguna Wildfire.&nbsp;</p><p>The wildfire was first reported Wednesday June 25, 2025, and is burning in an area that has undergone the National Environmental Policy Act (NEPA) process and previously been thinned and treated with prescribed fire. The objectives for the Laguna Wildfire prioritize the safety of firefighters and the public while protecting water quality in watersheds, water systems, and springs by minimizing fire intensity and uncharacteristic severe fire effects.</p><p><span>It is expected that the fire will restore the ecological process of fire across approximately 13,000 acres of forest land.</span></p>", "field_percent_of_perimeter": "48", "field_title_and_unit": "NMSNF Laguna Wildfire", "field_unit_code": "NMSNF", "id": "323748", "lat_deg": "36", "lat_min": "20", "lat_sec": "17", "long_deg": "106", "long_min": "45", "long_sec": "17", "measurement_type": "Acres", "size": "6244", "title": "Laguna Wildfire", "type": "Wildfire", "urlPath": "/nmsnf-laguna-wildfire"}, "type": "Feature"}, {"geometry": {"coordinates": [-115.426944, 37.6321], "type": "Point"}, "properties": {"changed": "1 day 3 hours ago", "created": "<time datetime=\"2025-07-01T17:55:40-04:00\">2025-07-01</time>\n", "field_active": "1", "field_incident_description": "", "field_incident_overview": "<p>The Mount Irish Fire is burning roughly 30 miles east of Rachel, Nevada in the Mount Irish Range.&nbsp;</p>", "field_percent_of_perimeter": "85", "field_title_and_unit": "NVELD Mount Irish Fire", "field_unit_code": "NVELD", "id": "323758", "lat_deg": "37", "lat_min": "37", "lat_sec": "55.56", "long_deg": "115", "long_min": "25", "long_sec": "37", "measurement_type": "Acres", "size": "6315", "title": "Mount Irish Fire", "type": "Wildfire", "urlPath": "/nveld-mount-irish-fire"}, "type": "Feature"}, {"geometry": {"coordinates": [-122.973611, 41.823333], "type": "Point"}, "properties": {"changed": "12 hours 42 minutes ago", "created": "<time datetime=\"2025-07-01T17:59:29-04:00\">2025-07-01</time>\n", "field_active": "1", "field_incident_description": "", "field_incident_overview": "<p>Following several days of widespread thunderstorms across the Klamath National Forest, a total of 17 wildfires have been confirmed as of the evening of July 5.</p><p>The two largest fires—the Summit Fire and the Jacket Fire—have been combined and are now being managed as the Marble Complex. A Complex Interagency Incident Management Team assumed command of the Marble Complex on the evening of July 5. Visit&nbsp;<a href=\"https://inciweb.wildfire.gov/incident-information/caknf-2025marble-complex\"><strong>https://inciweb.wildfire.gov/incident-information/caknf-2025marble-complex</strong></a>&nbsp;for additional information.</p><p>The remaining fires have either been declared contained, controlled, or fully extinguished. One single-tree fire located on a steep, narrow ridge near Etna Summit is being monitored by air. No smoke has been detected since helicopter bucket drops were conducted on July 2, the day it was discovered.</p><p>To ensure rapid detection and response to any new fire starts, the forest is utilizing a combination of fire lookouts, Unmanned Aerial Systems (UAS), and fixed-wing aircraft equipped with infrared sensors. Firefighting resources are strategically positioned throughout the forest, ready to respond at a moment’s notice. Crews, engines, aircraft, and overhead personnel have been mobilized from across California—and from as far away as Texas, Idaho, and Puerto Rico—to support the Klamath National Forest during this period of heightened fire activity.</p><p>&nbsp;</p><p><strong>For the latest updates on this incident, please call or visit:</strong></p><p>Website: <a href=\"https://inciweb.wildfire.gov/incident-information/caknf-klamath-national-forest-july-2025-lightning\">https://inciweb.wildfire.gov/incident-information/caknf-klamath-national-forest-july-2025-lightning</a></p><p>Incident Phone Line:&nbsp;<span> </span>530-643-0279 (Office Hours 8am-8pm)</p><p>&nbsp;</p><p>&nbsp;</p>", "field_percent_of_perimeter": "", "field_title_and_unit": "CAKNF Klamath National Forest July 2025 Lightning", "field_unit_code": "CAKNF", "id": "323759", "lat_deg": "41", "lat_min": "49", "lat_sec": "24", "long_deg": "122", "long_min": "58", "long_sec": "25", "measurement_type": "Acres", "size": "", "title": "Klamath National Forest July 2025 Lightning", "type": "Wildfire", "urlPath": "/caknf-klamath-national-forest-july-2025-lightning"}, "type": "Feature"}, {"geometry": {"coordinates": [-116.726111, 47.720278], "type": "Point"}, "properties": {"changed": "3 days 13 hours ago", "created": "<time datetime=\"2025-07-01T22:25:10-04:00\">2025-07-01</time>\n", "field_active": "1", "field_incident_description": "", "field_incident_overview": "<p>This incident is 100% contained as of 07/04/2025. The Forest area closure remains in place for public safety and will be rescinded as soon as is practicable. To check for any closures statewide, visit <a href=\"https://bit.ly/4laoyUd\"><span><strong>bit.ly/4laoyUd</strong></span></a></p><p>The Nettleton Gulch Fire started on June 29, 2025, near the popular recreation area, Canfield Mountain, in Coeur d'Alene, Idaho. The cause of the fire remains under investigation.&nbsp;</p><p>There is a law enforcement incident investigation happening at the fire's location. All questions regarding the law enforcement investigation should be directed to the Kootenai County Sheriff's Department. Their contact is Lt. Mark Ellis, PIO cell: (208) 758-1045.</p>", "field_percent_of_perimeter": "100", "field_title_and_unit": "IDMIS Nettleton Gulch", "field_unit_code": "IDMIS", "id": "323761", "lat_deg": "47", "lat_min": "43", "lat_sec": "13", "long_deg": "116", "long_min": "43", "long_sec": "34", "measurement_type": "Acres", "size": "23", "title": "Nettleton Gulch", "type": "Wildfire", "urlPath": "/idmis-nettleton-gulch"}, "type": "Feature"}, {"geometry": {"coordinates": [-120.046806, 35.096167], "type": "Point"}, "properties": {"changed": "4 hours 16 minutes ago", "created": "<time datetime=\"2025-07-02T20:33:39-04:00\">2025-07-02</time>\n", "field_active": "1", "field_incident_description": ".", "field_incident_overview": "<p><strong>UPDATES: </strong><a href=\"https://inciweb-prod-media-bucket.s3.us-gov-west-1.amazonaws.com/s3fs-public/2025-07/Update_Madre_Fire_07072025_Final.pdf?VersionId=d5N8JzMjaErc.wi3tTwIOfJ4d.oqUWP4\">Daily Update(pdf)</a> | &nbsp;<a href=\"https://inciweb-prod-media-bucket.s3.us-gov-west-1.amazonaws.com/s3fs-public/2025-07/SPANISH_Update_Madre_Fire_07072025_Final.pdf?VersionId=eYtWXIo3vkvhgpG.bxpz5iNIBHUvkTpB\">Actualización del Incidente (pdf)</a> &nbsp;| &nbsp;<a href=\"https://fb.watch/AHK5x4dudz/\">Operational Update Video</a></p><p><strong>MAPS: </strong><a href=\"https://inciweb.wildfire.gov/incident-maps-gallery/calpf-2025-madre-fire\">Public Information Map</a> | &nbsp;<a href=\"https://inciweb.wildfire.gov/incident-maps-gallery/calpf-2025-madre-fire\">Progression Map</a> &nbsp;|</p><p><span><strong>CAMERA VIEWS:&nbsp;</strong></span><a href=\"https://ops.alertcalifornia.org/cam-console/2265\"><span>Plowshare Peak</span></a></p><p><span><strong>AIR QUALITY:&nbsp;</strong></span><a href=\"https://fire.airnow.gov/\"><span>AirNow.gov</span></a><span>&nbsp; | </span><a href=\"https://www.slocleanair.org/air-quality/wildfire.php?fbclid=IwY2xjawLWXDtleHRuA2FlbQIxMABicmlkETFnT2ZOOWgxZDJYZjRFNkdqAR5fjpNLR_MWJJzloFiiWmZxNrbwlJYCSZJU2KDUCUNFgVwnkTgBIHAqiALxgw_aem_C-_D36PxGbPokYiC0QgmUw\"><span>San Luis Obispo County Air Pollution Control District</span></a> &nbsp;|</p><p>&nbsp;</p><p><strong>NOTE: </strong><span>Please join us tonight July 7th at 7:30 pm for the </span><a href=\"https://www.facebook.com/hashtag/madrefire?__eep__=6&amp;__cft__[0]=AZX-1gN8sH3Q95YkeOkXb_0K_vNUYLf751HtuIRenfffn_M9p_IrxdD5EuvPI6gjEEo5U-WT9vycY62qRijvcDgJilWMwMRxbMKciLSeJ9Z4SuKJsDBZtaw2wMosau3RoCuGpCoLFysT9EMhDNhY99nzVhqKKeO0nRa5EpOlnUERlRNaBLvDKjN4xNA3x0TL_oWZjJkm9nc5wsN1fxhNaPDd&amp;__tn__=*NK-R\"><span><strong>#MadreFire</strong></span></a><span> virtual community meeting. We will answer public questions regarding the Madre Fire after the presentation. Steaming live from the </span><a href=\"https://www.facebook.com/lospadresnationalforest\"><span>Los Padres National Forest Facebook</span></a><span> page.</span></p><p>&nbsp;</p><p><span><strong>INITIAL SITUATION: &nbsp;</strong>The Madre Fire broke out shortly after 1:00 pm on Wednesday, July 2, along Highway 166. The fire was estimated at 9,000 acres acres as mapped by fire air intel and is burning east-northeast onto the Carrizo Plain. Los Padres is in Unified Command with CALFIRE SLU and the Bureau of Land Management. A full response was initiated that included seven air tankers, and two helicopters along with multiple engines and hand crews.</span></p><p>&nbsp;</p><p><strong>CURRENT SITUATION: </strong><span>Firefighters are strengthening containment lines throughout the northwest and north perimeters, and mopping-up. Progress remains steady on the northeast and southwest perimeters, with dozer operations reinforcing lines. There is challenging terrain on the southwest side and crews are putting in handlines in areas that are inaccessible by dozers. Dozers and crews are working throughout the south side of the fire to make sure State Road 166 is protected.&nbsp;</span></p><p>&nbsp;</p><p><span><strong>EVACUATIONS:</strong></span></p><p><span>The <strong>County of San Luis Obispo</strong> has multiple alert and notification systems that can be used to provide emergency information.&nbsp;Two of these systems, Reverse 911 and AlertSLO require the public to register their devices to receive emergency information. For more information, please visit the following websites&nbsp;</span><a href=\"https://www.prepareslo.org/en/public-alerting.aspx\"><span>PrepareSLO.org</span></a><span> |<strong>&nbsp;</strong> </span><a href=\"http://readyslo.org/?fbclid=IwZXh0bgNhZW0CMTAAYnJpZBExY2NpZ1ZYTU8xZGExSTZtdwEeIlbfq9OHi9KQyHDEhiq7CAc4mJKe9A8mAAneI2XLkwdp2qeY_DA7a0_Ya0I_aem_t3e85hViQH9oGtdGJcjUjw\"><span>ReadySLO.org</span></a><span> | </span><a href=\"http://alertslo.org/?fbclid=IwZXh0bgNhZW0CMTAAYnJpZBExY2NpZ1ZYTU8xZGExSTZtdwEeFsCNAfLrTAvqyy0XVYoRV8NFGhb4rByv6I2jj-y_ivIz2xHf8WFYNLPZNTc_aem_xwY-QXZJsmc0vS4sjhmcFQ\"><span>AlertSLO.org</span></a> | <a href=\"https://www.emergencyslo.org/en/wireless-emergency-alerts.aspx?fbclid=IwY2xjawLXz29leHRuA2FlbQIxMABicmlkETFmeGZTMzdabTRJRE1YREg3AR4BDy1q5r6P_eGFCG-fgPj6BeMNjf0P5O1YIULviaU6Spf3gUbjenp2BMPq1A_aem_a3LxI59u7pgK9ALXUoNaRA\">Readyslo/wea</a></p><p><span>The emergency notification system for&nbsp;<strong>Kern County</strong>&nbsp;provides essential information quickly in a variety of situations, such as earthquakes, severe weather, fire, floods, or evacuation of buildings or neighborhoods&nbsp;</span><a href=\"https://kerncountyfire.org/education-safety/ready-kern/\"><span><strong>Sign up for Ready Kern</strong></span></a> &nbsp;| &nbsp;<a href=\"https://protect.genasys.com/search\"><span><strong> Interactive Evacuation Map - Genasys</strong></span></a></p><p><span>For the latest information on evacuations and available resources for </span><strong>Santa Barbara County</strong>, please visit <a href=\"https://www.readysbc.org/\">ReadySBC.org</a></p><p><span><strong>EVACUATION SHELTERS:</strong></span></p><ul><li><span><strong>Temporary -&nbsp;</strong>CA Valley CSD - 13080 Soda Lake Rd, Santa Margarita, CA 93453.</span></li></ul><p>&nbsp;</p><p><span><strong>AREA CLOSURES: &nbsp;</strong>All BLM lands in Carrizo Plain National Monument are closed to public access effective immediately. This emergency closure is for public and firefighter safety. Entry is prohibited and violators face federal penalties including fines and imprisonment<strong>.&nbsp;</strong>Please see&nbsp;</span><a href=\"https://www.blm.gov/sites/default/files/docs/2025-07/ECO_Carrizo_Madre-Fire.pdf\"><span>Emergency Closure Order</span></a></p><p>&nbsp;</p><p><span><strong>KNOW WHERE YOU CAN FLY:&nbsp;</strong>Drones pose a serious risk to firefighting and can cause air operations to cease. When drones interfere with firefighting efforts, a wildfire has the potential to grow larger and cause more damage. A FAA Temporary Flight Restriction (TFR) is in effect and any private aircraft or drone that violates the TFR could face serious criminal charges. For more information on drones the public can visit the FAA’s website at&nbsp;</span><a href=\"http://www.KnowBeforeYouFly.org\"><span>www.KnowBeforeYouFly.org</span></a><span>&nbsp; “If you fly, we can’t!”</span></p>", "field_percent_of_perimeter": "35", "field_title_and_unit": "CALPF 2025 Madre Fire", "field_unit_code": "CALPF", "id": "323774", "lat_deg": "35", "lat_min": "05", "lat_sec": "46.2", "long_deg": "120", "long_min": "02", "long_sec": "48.5", "measurement_type": "Acres", "size": "80603", "title": "2025 Madre Fire ", "type": "Wildfire", "urlPath": "/calpf-2025-madre-fire"}, "type": "Feature"}, {"geometry": {"coordinates": [-112.258333, 34.113611], "type": "Point"}, "properties": {"changed": "3 hours 34 minutes ago", "created": "<time datetime=\"2025-07-02T23:45:44-04:00\">2025-07-02</time>\n", "field_active": "1", "field_incident_description": "", "field_incident_overview": "<p>The Juniper Fire is a lightning-caused wildfire 5 miles west of Black Canyon City, Arizona impacting Bureau of Land Management, Arizona State Trust and Prescott National Forest lands.&nbsp;</p>", "field_percent_of_perimeter": "69", "field_title_and_unit": "AZPHD Juniper Fire", "field_unit_code": "AZPHD", "id": "323778", "lat_deg": "34", "lat_min": "06", "lat_sec": "49", "long_deg": "112", "long_min": "15", "long_sec": "30", "measurement_type": "Acres", "size": "600", "title": "Juniper Fire", "type": "Wildfire", "urlPath": "/azphd-juniper-fire"}, "type": "Feature"}, {"geometry": {"coordinates": [-121.990486, 40.872425], "type": "Point"}, "properties": {"changed": "15 hours 16 minutes ago", "created": "<time datetime=\"2025-07-03T16:41:37-04:00\">2025-07-03</time>\n", "field_active": "1", "field_incident_description": "", "field_incident_overview": "<p><span>Wildland Firefighters are responding to multiple wildfires on the Shasta-Trinity National Forest with a coordinated effort of ground crews and aerial resources following widespread thunderstorms and lightning on the afternoon and evening of June 30, 2025. </span>The Shasta-Trinity National Forest saw more than 3,100 lightning strikes across the Forest, between June 30 and July 2, resulting in several wildfires.</p><p>The three largest wildfire incidents right now are the:</p><ul><li><a href=\"https://inciweb.wildfire.gov/incident-information/cashf-horse\">Horse Fire</a> west of Lakehead</li><li><a href=\"https://inciweb.wildfire.gov/cashf-green-fire\">Green Fire</a> east of Shasta Lake</li><li><a href=\"https://inciweb.wildfire.gov/incident-information//cashf-helena-fire\">Helena Fire</a> near the community of Helena.</li></ul><p>To see an up to date list of the fires, please view the <a href=\"https://inciweb.wildfire.gov/incident-announcement/cashf-2025-shastatrinity-lightning\">announcements section</a> of this page.</p><p>Resources are actively engaged with these fires and several more across the Forest. Additional resources are enroute to support the wildfire response. Firefighters will continue monitoring the forest in the days ahead for holdover fires that may emerge from this week’s storms.</p><p>We ask the public to please avoid areas where crews are working. Your cooperation helps firefighters contain these fires quickly and safely.<br>&nbsp;</p>", "field_percent_of_perimeter": "", "field_title_and_unit": "CASHF 2025 ShastaTrinity Lightning", "field_unit_code": "CASHF", "id": "323788", "lat_deg": "40", "lat_min": "52", "lat_sec": "20.73", "long_deg": "121", "long_min": "59", "long_sec": "25.7496", "measurement_type": "Acres", "size": "", "title": "2025 Shasta-Trinity Lightning", "type": "Wildfire", "urlPath": "/cashf-2025-shastatrinity-lightning"}, "type": "Feature"}, {"geometry": {"coordinates": [-117.547028, 47.282194], "type": "Point"}, "properties": {"changed": "3 hours 10 minutes ago", "created": "<time datetime=\"2025-07-03T17:24:27-04:00\">2025-07-03</time>\n", "field_active": "1", "field_incident_description": "Yesterday, crews continued mop-up using infrared units to locate hot spots. Rehab activities continued by crews and with assistance from a dozer. Hoses and equipment used during suppression efforts were backhauled. The primary focus for mop-up was the north end of the fire where the burn out operations occurred, and crews made good progress. ", "field_incident_overview": "<p><span>Today, crews will continue focusing on mop-up, rehabilitation and patrol, before demobilizing and returning to&nbsp;home districts or reassignment to other fires.&nbsp; The Siegel Fire will be turned over to local DNR crews who will focus on continued patrol of the fireline, mop-up of hotspots as well as complete any additional needed rehabilitation.&nbsp;</span></p><p><span>Smoke will be visible over the next few days. Partially and unburned fuels exist within the fire perimeter and will continue to smolder.&nbsp; In fire terms, areas of the Siegel Fire had a dirty burn - an area where unburned pockets of fuel are mixed with burned areas and susceptible to burning. These small pockets are unlikely to spread beyond the containment line. Smoke from interior burning is generally not a concern. If you do see some active burning close to the fire’s edge or burning that is a concern, please call Northeast Washington Interagency Communications Center (NEWICC) at 509-685-6900.</span></p><p><span>Our Incident Management Team would like to thank everyone in the surrounding communities for their support of the firefighters and our team. It was instrumental to our success!</span></p>", "field_percent_of_perimeter": "93", "field_title_and_unit": "WANES Siegel Fire", "field_unit_code": "WANES", "id": "323789", "lat_deg": "47", "lat_min": "16", "lat_sec": "55.9", "long_deg": "117", "long_min": "32", "long_sec": "49.3", "measurement_type": "Acres", "size": "700", "title": "Siegel Fire", "type": "Wildfire", "urlPath": "/wanes-siegel-fire"}, "type": "Feature"}, {"geometry": {"coordinates": [-106.788056, 41.018611], "type": "Point"}, "properties": {"changed": "10 hours 38 minutes ago", "created": "<time datetime=\"2025-07-03T23:09:49-04:00\">2025-07-03</time>\n", "field_active": "1", "field_incident_description": "", "field_incident_overview": "<p>July 7 - 8 a.m. update</p><ul><li>The Beaver Dam Fire was declared contained and controlled on Sunday, July 6</li><li>Final fire size is 6 acres</li><li>USFS Law Enforcement &amp; Investigations has confirmed that lightning was the source of ignition</li><li>Transition to a Type V Incident Commander occurred Saturday evening, July 5</li><li>The Forest Closure Order will be rescinded today</li><li>Fire location is in southern Carbon Co., Wyo., near the Colo./Wyo. state line, Medicine Bow National Forest. It is east of Beaver Dam Park and Forest Road 496, NE of East Fork Encampment River Trailhead</li><li>The 2016 Broadway Fire footprint is very close, NE of the Beaver Dam Fire</li><li>Aggressive initial response occurred on Thursday, July 3 by U.S. Forest Service, Jackson Co., Colo., and Encampment, Wyo. engines</li><li>Operation Sky Hammer, initial attack helicopter program in the USFS Rocky Mountain Region, dumped 50,000 gallons of water on the fire with two Type I helicopters on Friday, July 4</li><li>The fire was reported the afternoon of Thursday, July 3, 2025</li></ul>", "field_percent_of_perimeter": "100", "field_title_and_unit": "WYMRF Beaver Dam Fire", "field_unit_code": "WYMRF", "id": "323798", "lat_deg": "41", "lat_min": "01", "lat_sec": "07", "long_deg": "106", "long_min": "47", "long_sec": "17", "measurement_type": "Acres", "size": "6", "title": "Beaver Dam Fire", "type": "Wildfire", "urlPath": "/wymrf-beaver-dam-fire"}, "type": "Feature"}, {"geometry": {"coordinates": [-117.864444, 40.724167], "type": "Point"}, "properties": {"changed": "3 hours 42 minutes ago", "created": "<time datetime=\"2025-07-04T13:35:04-04:00\">2025-07-04</time>\n", "field_active": "1", "field_incident_description": "", "field_incident_overview": "<p>Reported near Imlay, Barber Canyon Area on evening of July 3rd. Fire burned actively through the night on the East Range with high rates of spread influenced by terrain and outflow winds.</p><p>Fire is burning in sage, Juniper and abundant grass in steep and rugged terrain.</p>", "field_percent_of_perimeter": "75", "field_title_and_unit": "NVWID Barber Fire", "field_unit_code": "NVWID", "id": "323806", "lat_deg": "40", "lat_min": "42", "lat_sec": "87", "long_deg": "117", "long_min": "51", "long_sec": "52", "measurement_type": "Acres", "size": "17583", "title": "Barber Fire", "type": "Wildfire", "urlPath": "/nvwid-barber-fire"}, "type": "Feature"}, {"geometry": {"coordinates": [-122.551667, 40.8725], "type": "Point"}, "properties": {"changed": "9 hours 38 minutes ago", "created": "<time datetime=\"2025-07-04T13:46:35-04:00\">2025-07-04</time>\n", "field_active": "1", "field_incident_description": "The fire is located near Schell Mountain, west of Lakehead California, in the 2018 Carr Fire footprint.  ", "field_incident_overview": "<p><span>Wildland Firefighters are fighting the Horse Fire west of Lakehead with a coordinated effort of ground crews and aerial resources.&nbsp;</span></p><p><span>Firefighters continued working through hot spots on the Horse Fire, battling to reach these areas in thick snag patches and steep ravines overnight and into Monday morning.</span></p><p><span>The Horse Fire presents special challenges, notably its steep terrain and hot temperatures. Since most of the fire footprint is in an old burn scar and a previous logging area, many of the places where firefighters are working is sun-exposed.</span></p><p><span>With high temperatures and rugged terrain, we continue to prioritize firefighter and public safety as suppression efforts move forward. Additional resources remain committed to both incidents to build upon the gains already made.</span></p><p><span>The Horse Fire started following widespread thunderstorms and lightning on the afternoon and evening of June 30, 2025. </span>The Shasta-Trinity National Forest saw more than 3,100 lightning strikes across the Forest, between June 30 and July 2, resulting in several wildfires. (<a href=\"https://inciweb.wildfire.gov/incident-information/cashf-2025-shastatrinity-lightning\">Wildfire information for other current incidents</a> on the Shasta-Trinity).</p><p>Additional resources are enroute to support the wildfire response. Firefighters will continue monitoring the forest in the days ahead for holdover fires that may emerge from this week’s storms.</p><p>We ask the public to please avoid areas where crews are working. Your cooperation helps firefighters contain these fires quickly and safely.</p>", "field_percent_of_perimeter": "60", "field_title_and_unit": "CASHF Horse Fire", "field_unit_code": "CASHF", "id": "323809", "lat_deg": "40", "lat_min": "52", "lat_sec": "21", "long_deg": "122", "long_min": "33", "long_sec": "6", "measurement_type": "Acres", "size": "385", "title": "Horse Fire", "type": "Wildfire", "urlPath": "/cashf-horse-fire"}, "type": "Feature"}, {"geometry": {"coordinates": [-122.096667, 40.833889], "type": "Point"}, "properties": {"changed": "5 hours 59 minutes ago", "created": "<time datetime=\"2025-07-04T14:19:59-04:00\">2025-07-04</time>\n", "field_active": "1", "field_incident_description": "", "field_incident_overview": "<p><span>Firefighters are engaging in a full suppression strategy in steep and rocky terrain utilizing aircraft and existing dozer lines from the 2024 Shoe Fire.&nbsp;Control objectives are to keep the fire north of Pit River, southeast of Sulanharas Creek, and southwest of Fenders Ferry Road.&nbsp;</span></p><p><span>Steep terrain, dry fuels, high temperatures and low humidity allowed the fire growth in the afternoons. Helicopters are dropping water in the areas of progression that cannot be reached by the firefighters. We have two type 1 helicopters and one type 2 helicopter assigned to the incident.&nbsp; They will be dropping water in active areas to slow the progression of the fire.&nbsp;&nbsp;</span></p><p><span>On the ground heavy equipment is improving and widening roads for access while firefighters are working closely with the READs (Resource Advisors) to protect the Devil’s Rock-Hosselkus research area and other cultural sites.&nbsp;</span></p><p>The Green Fire started following widespread thunderstorms and lightning on the afternoon and evening of June 30, 2025. The Shasta-Trinity National Forest saw more than 3,100 lightning strikes across the Forest, between June 30 and July 2, resulting in several wildfires. (<a href=\"https://inciweb.wildfire.gov/incident-information/cashf-2025-shastatrinity-lightning\">Wildfire information for other current incidents</a> on the Shasta-Trinity). Firefighters will continue monitoring the forest in the days ahead for holdover fires that may emerge from this week’s storms.</p><p>We ask the public to please avoid areas where crews are working. Your cooperation helps firefighters contain these fires quickly and safely.</p>", "field_percent_of_perimeter": "0", "field_title_and_unit": "CASHF Green Fire", "field_unit_code": "CASHF", "id": "323810", "lat_deg": "40", "lat_min": "50", "lat_sec": " 2", "long_deg": "122", "long_min": "5", "long_sec": "48", "measurement_type": "Acres", "size": "1381", "title": "Green Fire", "type": "Wildfire", "urlPath": "/cashf-green-fire"}, "type": "Feature"}, {"geometry": {"coordinates": [-123.143056, 40.800278], "type": "Point"}, "properties": {"changed": "3 hours 29 minutes ago", "created": "<time datetime=\"2025-07-04T17:38:31-04:00\">2025-07-04</time>\n", "field_active": "1", "field_incident_description": "", "field_incident_overview": "<p><span>The containment of the Helena Fire has risen to 60% as firefighters on the ground have created handline two feet wide around the incident and helicopter resources drop water buckets on the steep terrain. The current acreage remains at 116 Acres; however, personnel are walking the fire perimeter to verify. All on-the-ground resources have been able to take advantage of the recovery of the overnight humidity, low temperatures, and shade in the morning to keep the Helena Fire within set control lines.&nbsp;</span></p><p><span>In the northern perimeter of the fire, minimal growth was observed from creeping, a method of fire spread with low flame intensity and slow movement due to increased humidity and low temperatures. The creeping allowed fire personnel to respond more directly due to the movement of the fire perimeter to a more accessible location. The goal for today on the northern side is to continue to improve control lines. On the southern end, there was no movement outside of built control lines, and additional handline was able to be made where previously not accomplished. The new handlines will continue to be improved with mop-up also taking place utilizing bladder bags with water to drown out hot spots.&nbsp;</span></p><p><span>The support of partner agencies such as CAL FIRE and Bureau of Land Management has been critical to suppression efforts. By utilizing agency, partner agency, and contracted resources, control lines were able to be established south and east of the fire perimeter towards the North Fork and west of the East Fork, respectively. On the northwestern perimeter, lines continue to be built, where able. Where resources have not been able to go direct on the ground, air support has been critical.</span></p><p>With high temperatures and rugged terrain, we continue to prioritize firefighter and public safety as suppression efforts move forward. Additional resources remain committed to incidents to build upon the gains already made.<br><br><span>If visiting the area of Helena, recreators are advised to use caution when driving and to limit interactions with fire personnel who are engaged with fire suppression efforts. We ask the public to please avoid areas where crews are working. Your cooperation helps firefighters contain these fires quickly and safely.</span></p>", "field_percent_of_perimeter": "60", "field_title_and_unit": "CASHF Helena Fire", "field_unit_code": "CASHF", "id": "323812", "lat_deg": "40", "lat_min": "47", "lat_sec": "61", "long_deg": "123", "long_min": "7", "long_sec": "95", "measurement_type": "Acres", "size": "116", "title": "Helena Fire", "type": "Wildfire", "urlPath": "/cashf-helena-fire"}, "type": "Feature"}, {"geometry": {"coordinates": [-123.148272, 41.522006], "type": "Point"}, "properties": {"changed": "3 hours ago", "created": "<time datetime=\"2025-07-04T20:29:20-04:00\">2025-07-04</time>\n", "field_active": "1", "field_incident_description": "Summit Fire: 395 acres, 0% contained<br />\r\nJacket Fire: 50 acres, 5% contained ", "field_incident_overview": "<p>After receiving widespread thunderstorms and lightning across the Klamath National Forest earlier this week, 17 fires have been reported. Two of these fires, the Summit and the Jacket, have been complexed into a single incident called the Marble Complex.&nbsp;</p><p>Complex Interagency Incident Management Team 9 (Gould) assumed command of the Marble Complex at 6:00 p.m. on July 5, 2025. &nbsp;</p><p><span><strong>Fire&nbsp;Information:</strong>&nbsp;530-395-1268,&nbsp;8&nbsp;a.m.&nbsp;to&nbsp;8&nbsp;p.m.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span><br><span><strong>Email:</strong>&nbsp;</span><a href=\"mailto:2025.MarbleComplex@firenet.gov\"><span>2025.MarbleComplex@firenet.gov</span></a><span>&nbsp;</span><br><span><strong>Linktree:</strong>&nbsp;</span><a href=\"https://linktr.ee/2025MarbleComplex\"><span>linktr.ee/2025MarbleComplex</span></a><span>&nbsp;</span></p>", "field_percent_of_perimeter": "5", "field_title_and_unit": "CAKNF 2025 Marble Complex", "field_unit_code": "CAKNF", "id": "323816", "lat_deg": "41", "lat_min": "31", "lat_sec": "19.22", "long_deg": "123", "long_min": "8", "long_sec": "53.78", "measurement_type": "Acres", "size": "445", "title": "2025 Marble Complex", "type": "Wildfire", "urlPath": "/caknf-2025-marble-complex"}, "type": "Feature"}, {"geometry": {"coordinates": [-108.336944, 33.048611], "type": "Point"}, "properties": {"changed": "9 hours 2 minutes ago", "created": "<time datetime=\"2025-07-05T11:49:33-04:00\">2025-07-05</time>\n", "field_active": "1", "field_incident_description": "", "field_incident_overview": "<p>The Panther Fire was reported on July 2, 2025, at 2:37 PM. The Gila Las Cruces Type 3 Incident Management Team assumed command of this fire on July 4, 2025. Updates will be provided in conjunction with the Trout Fire on the incident page at https://inciweb.wildfire.gov/nmgnf-trout-fire.</p>", "field_percent_of_perimeter": "0", "field_title_and_unit": "NMGNF Panther Fire", "field_unit_code": "NMGNF", "id": "323826", "lat_deg": "33", "lat_min": "02", "lat_sec": "55", "long_deg": "108", "long_min": "20", "long_sec": "13", "measurement_type": "Acres", "size": "80", "title": "Panther Fire", "type": "Wildfire", "urlPath": "/nmgnf-panther-fire"}, "type": "Feature"}, {"geometry": {"coordinates": [-123.417778, 41.325556], "type": "Point"}, "properties": {"changed": "1 hour 31 minutes ago", "created": "<time datetime=\"2025-07-05T16:48:49-04:00\">2025-07-05</time>\n", "field_active": "1", "field_incident_description": "The Butler Fire is burning northeast of Orleans near Butler Mountain above Salmon River Road within the 2024 Boise Fire, the 2020 Salmon Fire, and the 2013 Butler Fire footprints. The fire was reported in the evening of July 3, 2025, resulting from a lightning storm that passed through the area earlier in the week. The remote, steep slopes, and rugged ridgelines combined with heavy brush and snag fuel loads have complicated firefighter safety as well as access to the fire.", "field_incident_overview": "<p><strong>INITIAL SITUATION: </strong>The Butler Fire, on the Six Rivers National Forest, Orleans Ukonom Ranger District, is approximately 507 acres and is burning northeast of Orleans near Butler Mountain above Salmon River Road within the 2024 Boise Fire, the 2020 Salmon Fire, and the 2013 Butler Fire footprints. The fire was reported on the evening of July 3, 2025, as a result of a lightning storm that passed through the area earlier in the week.&nbsp;</p><p>The fire is burning in steep and rugged terrain with heavy brush and snag fuel loads on the ridgetop and has been actively backing downslope with rollout towards Lewis and Butler Creek. Access to the fire perimeter is difficult, as it is miles from the nearest road. Firefighters spent the July 4 cutting a trail to the fire through fallen trees and thick brush and were able to access the fire on the ground. They were supported with air resources monitoring the fire and helicopters making water drops to slow fire spread and cool hotspots.&nbsp;</p><p>Ground resources have been prepping and protecting values at risk along the Salmon River Road, such as the <span>communities of Butler Flat, Lewis Creek, Orleans, Forks of Salmon, road access along Salmon River Road, as well as cultural, natural, and heritage resources</span> present in the area. Approximately 20 structures are threatened in the Butler Flat community and property at Lewis Creek, located two miles downslope along Salmon River Road.&nbsp;</p><p>The North Coast Type 3 Incident Management Team, led by Incident Commander Bryan Lanning and Deputy Incident Commander Rod Mendes, has assumed command of the incident. The Butler Fire is being managed with a full suppression strategy emphasizing firefighter and public safety.</p><p><strong>EVACUATIONS &amp; CLOSURES:</strong> An Evacuation Order has been issued for SIS-1703 (no residents). Warnings are now in place for zone SIS-1704 (Butler Creek, Lewis Creek, Bloomer Mine residents and Nordheimer Campground), SIS-1707, and SIS 1803-A (no residents). There are currently no planned road closures or delays along Salmon River Road, however, the public may experience delays as crews brush along the road. Despite the Evacuation Warning, Nordheimer Campground remains open. Campers should monitor the situation and be prepared for conditions to change. <a href=\"https://protect.genasys.com/location?z=14&amp;latlon=41.29085724138827%2C-123.36768821412937\">https://protect.genasys.com/location?z=14&amp;latlon=41.29085724138827%2C-123.36768821412937</a></p>", "field_percent_of_perimeter": "0", "field_title_and_unit": "CASRF Butler Fire", "field_unit_code": "CASRF", "id": "323834", "lat_deg": "41", "lat_min": "18", "lat_sec": "92", "long_deg": "123", "long_min": "24", "long_sec": "64", "measurement_type": "Acres", "size": "507", "title": "Butler Fire", "type": "Wildfire", "urlPath": "/casrf-butler-fire"}, "type": "Feature"}, {"geometry": {"coordinates": [-118.867222, 41.498889], "type": "Point"}, "properties": {"changed": "3 hours 48 minutes ago", "created": "<time datetime=\"2025-07-06T12:55:41-04:00\">2025-07-06</time>\n", "field_active": "1", "field_incident_description": "", "field_incident_overview": "<p>The Bartlett Fire is in burning grass and brush near Bartlett Peak, 60 Miles NW of Winnemucca, NV.</p>", "field_percent_of_perimeter": "75", "field_title_and_unit": "NVWID Bartlett Fire", "field_unit_code": "NVWID", "id": "323856", "lat_deg": "41", "lat_min": "29", "lat_sec": "56", "long_deg": "118", "long_min": "52", "long_sec": "2", "measurement_type": "Acres", "size": "6169", "title": "Bartlett Fire", "type": "Wildfire", "urlPath": "/nvwid-bartlett-fire"}, "type": "Feature"}, {"geometry": {"coordinates": [-108.524167, 33.375], "type": "Point"}, "properties": {"changed": "2 hours 33 minutes ago", "created": "<time datetime=\"2025-07-07T23:26:08-04:00\">2025-07-07</time>\n", "field_active": "1", "field_incident_description": "", "field_incident_overview": "<p>The Turkeyfeather Fire was reported on June 30,2025 in the n<span>orthern Gila Wilderness near Iron Creek and Cooper Canyon. The west side of the fire is hitting the 2025 Iron Fire burn scar.&nbsp;</span>&nbsp;</p>", "field_percent_of_perimeter": "0", "field_title_and_unit": "NMGNF 2025TurkeyfeatherGNF", "field_unit_code": "NMGNF", "id": "323894", "lat_deg": "33", "lat_min": "22", "lat_sec": "30", "long_deg": "108", "long_min": "31", "long_sec": "27", "measurement_type": "Acres", "size": "3250", "title": "2025-Turkeyfeather-GNF", "type": "Wildfire", "urlPath": "/nmgnf-2025turkeyfeathergnf"}, "type": "Feature"}], "type": "FeatureCollection"}
